.. _CM Structures:

==========================
CM Structures
==========================

.. toctree::
   :maxdepth: 1


* :ref:`CMachineState<CMachineState>`
* :ref:`CMachineStates<CMachineStates>`
* :ref:`CMapStringToPtr<CMapStringToPtr>`
* :ref:`CMapStringToPtr\:\:CAssoc<CMapStringToPtrCAssoc>`
* :ref:`CMapStringToString<CMapStringToString>`
* :ref:`CMapStringToString\:\:CAssoc<CMapStringToStringCAssoc>`
* :ref:`CMapWordToPtr<CMapWordToPtr>`
* :ref:`CMapWordToPtr\:\:CAssoc<CMapWordToPtrCAssoc>`
* :ref:`CMarker<CMarker>`
* :ref:`CMemINI<CMemINI>`
* :ref:`CMemINIFile<CMemINIFile>`
* :ref:`CMemINIRes<CMemINIRes>`
* :ref:`CMemINISection<CMemINISection>`
* :ref:`CMemINIValue<CMemINIValue>`
* :ref:`CMessage<CMessage>`
* :ref:`CMessageAddAction<CMessageAddAction>`
* :ref:`CMessageAddClairvoyance<CMessageAddClairvoyance>`
* :ref:`CMessageAddEffect<CMessageAddEffect>`
* :ref:`CMessageAddItem<CMessageAddItem>`
* :ref:`CMessageAddVVCInternal<CMessageAddVVCInternal>`
* :ref:`CMessageAllowDialogInterrupt<CMessageAllowDialogInterrupt>`
* :ref:`CMessageAnimationChange<CMessageAnimationChange>`
* :ref:`CMessageChangeDirection<CMessageChangeDirection>`
* :ref:`CMessageChangeStoreMarkup<CMessageChangeStoreMarkup>`
* :ref:`CMessageCheckForForcedDialogEnd<CMessageCheckForForcedDialogEnd>`
* :ref:`CMessageCleanAir<CMessageCleanAir>`
* :ref:`CMessageClearActions<CMessageClearActions>`
* :ref:`CMessageClearDialogActions<CMessageClearDialogActions>`

| 0x00       | 4        | :ref:`CObject<CObject>`                                     | m_cObject        |
+------------+----------+-------------------------------------------------------------+------------------+
| 0x04       | 4        | :ref:`CMapStringToPtr\:\:CAssoc<CMapStringToPtrCAssoc>`\*\* | m_pHashTable     |
+------------+----------+-------------------------------------------------------------+------------------+
| 0x08       | 4        | unsigned int                                                | m_nHashTableSize |
+------------+----------+-------------------------------------------------------------+------------------+
| 0x0C       | 4        | int                                                         | m_nCount         |
+------------+----------+-------------------------------------------------------------+------------------+
| 0x10       | 4        | :ref:`CMapStringToPtr\:\:CAssoc<CMapStringToPtrCAssoc>`\*   | m_pFreeList      |
+------------+----------+-------------------------------------------------------------+------------------+
| 0x14       | 4        | :ref:`CPlex<CPlex>`\*                                       | m_pBlocks        |
+------------+----------+-------------------------------------------------------------+------------------+
| 0x18       | 4        | int                                                         | m_nBlockSize     |
+------------+----------+-------------------------------------------------------------+------------------+

Asm Definition

::

   CMapStringToPtr      struct
     m_cObject          CObject <>
     m_pHashTable       dd ? ; CMapStringToPtr::CAssoc** 
     m_nHashTableSize   dd ?
     m_nCount           dd ?
     m_pFreeList        dd ? ; CMapStringToPtr::CAssoc* 
     m_pBlocks          dd ? ; CPlex* 
     m_nBlockSize       dd ?
   CMapStringToPtr      ends


.. _CMapStringToPtrCAssoc:

CMapStringToPtr\:\:CAssoc
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+-------------------------------------------------------------+------------+
| **Offset** | **Size** | **Type**                                                    | **Field**  |
+------------+----------+-------------------------------------------------------------+------------+
| 0x00       | 4        | :ref:`CMapStringToPtr\:\:CAssoc<CMapStringToPtrCAssoc>`\*   | pNext      |
+------------+----------+-------------------------------------------------------------+------------+
| 0x04       | 4        | unsigned int                                                | nHashValue |
+------------+----------+-------------------------------------------------------------+------------+
| 0x08       | 4        | :ref:`CString<CString>`                                     | key        |
+------------+----------+-------------------------------------------------------------+------------+
| 0x0C       | 4        | void\*                                                      | value      |
+------------+----------+-------------------------------------------------------------+------------+

Asm Definition

::

      data +0x00 [sizeof=4] CMapStringToPtr::CAssoc* pNext
      data +0x04 [sizeof=4] unsigned int nHashValue
      data +0x08 [sizeof=4] CString key
      data +0x0c [sizeof=4] void* value


.. _CMapStringToString:

CMapStringToString
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+-------------------------------------------------------------------+--------------+
| **Offset** | **Size** | **Type**                                                          | **Field**    |
+------------+----------+-------------------------------------------------------------------+--------------+
| 0x00       | 4        | :ref:`CObject<CObject>`                                           | m_cObject    |
+------------+----------+-------------------------------------------------------------------+--------------+
| 0x04       | 4        | :ref:`CMapStringToString\:\:CAssoc<CMapStringToStringCAssoc>`\*\* | m_pHashTable |
+------------+----------+-------------------------------------------------------------------+--------------+
| 0x08       | 4        | unsigned int                                                      | nHashValue   |
