.. _CS Structures:

==========================
CS Structures
==========================

.. toctree::
   :maxdepth: 1


* :ref:`CSaveGameSlot<CSaveGameSlot>`
* :ref:`CSavedGameFamiliars<CSavedGameFamiliars>`
* :ref:`CSavedGameHeader<CSavedGameHeader>`
* :ref:`CSavedGameJournalEntry<CSavedGameJournalEntry>`
* :ref:`CSavedGamePartyCreature<CSavedGamePartyCreature>`
* :ref:`CSavedGameStoredLocation<CSavedGameStoredLocation>`
* :ref:`CSchoolAndSecondaryDecrementing<CSchoolAndSecondaryDecrementing>`
* :ref:`CScreenAI<CScreenAI>`
* :ref:`CScreenChapter<CScreenChapter>`
* :ref:`CScreenCharacter<CScreenCharacter>`
* :ref:`CScreenCharacterStoredMageSpell<CScreenCharacterStoredMageSpell>`
* :ref:`CScreenConnection<CScreenConnection>`
* :ref:`CScreenCreateChar<CScreenCreateChar>`
* :ref:`CScreenCreateParty<CScreenCreateParty>`
* :ref:`CScreenDLC<CScreenDLC>`
* :ref:`CScreenInventory<CScreenInventory>`
* :ref:`CScreenJournal<CScreenJournal>`
* :ref:`CScreenLoad<CScreenLoad>`
* :ref:`CScreenMap<CScreenMap>`
* :ref:`CScreenMovies<CScreenMovies>`
* :ref:`CScreenMultiPlayer<CScreenMultiPlayer>`
* :ref:`CScreenOptions<CScreenOptions>`
* :ref:`CScreenPriestSpell<CScreenPriestSpell>`
* :ref:`CScreenSave<CScreenSave>`
* :ref:`CScreenStart<CScreenStart>`
* :ref:`CScreenStore<CScreenStore>`
* :ref:`CScreenStoreItem<CScreenStoreItem>`
* :ref:`CScreenWizSpell<CScreenWizSpell>`
* :ref:`CScreenWorld<CScreenWorld>`
* :ref:`CScreenWorldMap<CScreenWorldMap>`
* :ref:`CScriptCache<CScriptCache>`

|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

      base +0x00 [sizeof=44] CBaldurEngine
      data +0x2c [sizeof=4] long m_nStupidMovieWait
      data +0x30 [sizeof=4] int m_bProtagonistInStartArea
      data +0x34 [sizeof=4] long m_nProtagonistMoveMax
      data +0x38 [sizeof=4] int m_bWaitToRender
      data +0x3c [sizeof=56] SDL_Event flickEvent
      data +0x74 [sizeof=4] int m_bIgnoreDisplayTextTop
      data +0x78 [sizeof=4] int nCounter
      data +0x7c [sizeof=4] long m_boredCount
      data +0x80 [sizeof=4] int m_bored
      data +0x84 [sizeof=4] int m_playerShutdown
      data +0x88 [sizeof=4] int m_bShiftKeyDown
      data +0x8c [sizeof=4] int m_bMenuKeyDown
      data +0x90 [sizeof=4] int m_bCtrlKeyDown
      data +0x94 [sizeof=4] int m_bCapsLockKeyOn
      data +0x98 [sizeof=1] unsigned char m_bPaused
      data +0x99 [sizeof=1] unsigned char m_bHardPaused
      data +0x9a [sizeof=1] unsigned char m_bHostOnlyPaused
      data +0x9b [sizeof=1] unsigned char m_bVisualPaused
      data +0x9c [sizeof=1] unsigned char m_bFirstRender
      <padding> (3 bytes)
      data +0xa0 [sizeof=4] int m_bPausedBeforePickParty
      data +0xa4 [sizeof=4] int m_bCheatKeys
      data +0xa8 [sizeof=4] int m_bMButtonDown
      data +0xac [sizeof=4] int m_bMButtonDragged
      data +0xb0 [sizeof=4] int m_bSetStartViewCenter
      data +0xb4 [sizeof=8] CPoint m_ptStartViewCenter
      data +0xbc [sizeof=2] short m_sequence
      data +0xbe [sizeof=1] unsigned char m_facing
      data +0xbf [sizeof=1] unsigned char m_bloodLevel
      data +0xc0 [sizeof=2] unsigned short m_castingGlow
      data +0xc2 [sizeof=1] unsigned char m_hitEffect
      <padding> (1 bytes)
      data +0xc4 [sizeof=2] short m_renderText
      <padding> (2 bytes)
      data +0xc8 [sizeof=4] int m_newText
      data +0xcc [sizeof=32] CVidFont m_vidFont
      data +0xec [sizeof=32] CVidFont m_vidFont2
      data +0x10c [sizeof=1176] CKeyInfo m_pVirtualKeys[98]
      data +0x5a4 [sizeof=392] int m_pVirtualKeysFlags[98]
      data +0x72c [sizeof=104] CGameDialogSprite m_internalLoadedDialog
      data +0x794 [sizeof=4] CGameDialogSprite* m_pCurrentDialog
      data +0x798 [sizeof=8] CPoint m_dialogStartPos
      data +0x7a0 [sizeof=8] CResRef m_dialogStartArea
      data +0x7a8 [sizeof=4] int m_dialogPausing
      data +0x7ac [sizeof=16] CRect m_newViewSize
      data +0x7bc [sizeof=4] int m_bForceViewSize
      data +0x7c0 [sizeof=1] unsigned char m_waitingOnResize
      data +0x7c1 [sizeof=1] unsigned char m_storeText
      <padding> (2 bytes)
      data +0x7c4 [sizeof=4] CString m_consoleText
      data +0x7c8 [sizeof=4] int m_nTopContainerRow
      data +0x7cc [sizeof=4] int m_nTopGroupRow
      data +0x7d0 [sizeof=1] unsigned char m_bForceDitherToggledOn
      <padding> (3 bytes)
      data +0x7d4 [sizeof=276] CWeather m_WeatherController
      data +0x8e8 [sizeof=4] long m_scrollLockId
      data +0x8ec [sizeof=2] short m_nResponseMarker
      <padding> (2 bytes)
      data +0x8f0 [sizeof=4] int m_bBlockStepDialog
      data +0x8f4 [sizeof=4] long m_interactionIndex
      data +0x8f8 [sizeof=4] long m_interactionTarget
      data +0x8fc [sizeof=4] CString m_interactionString
      data +0x900 [sizeof=4] long m_interactionCounter
      data +0x904 [sizeof=4] int m_interactionForce
      data +0x908 [sizeof=4] long m_interactionTime
      data +0x90c [sizeof=4] long m_lastInteractionIndex
      data +0x910 [sizeof=1] unsigned char m_bSetNightOnActivate
      data +0x911 [sizeof=1] unsigned char m_bSetDayOnActivate
      <padding> (2 bytes)
      data +0x914 [sizeof=4] int m_ambianceForce
      data +0x918 [sizeof=4] unsigned long m_deltaTime
      data +0x91c [sizeof=4] int m_nChatMessageCount
      data +0x920 [sizeof=8] CResRef m_movie
      data +0x928 [sizeof=1] unsigned char m_bInControlOfDialog
      data +0x929 [sizeof=1] unsigned char m_bInControlOfStore
      <padding> (2 bytes)
      data +0x92c [sizeof=4] int m_bGameOverPanel
      data +0x930 [sizeof=8] CResRef m_movieDelay
      data +0x938 [sizeof=4] long m_autoPauseId
      data +0x93c [sizeof=4] unsigned long m_autoPauseRef
      data +0x940 [sizeof=4] unsigned long m_autoPauseColor
      data +0x944 [sizeof=4] unsigned long m_autoPauseName
      data +0x948 [sizeof=4] int m_nStoreChatMessageCount
      data +0x94c [sizeof=4] long m_nPickPartyRemoveCharacterId
      data +0x950 [sizeof=40] long m_aPickPartyCharacter[10]
      data +0x978 [sizeof=4] int m_nPickPartyNumCharacters
      data +0x97c [sizeof=4] unsigned long m_strErrorText
      data +0x980 [sizeof=12] unsigned long m_strErrorButtonText[3]
      data +0x98c [sizeof=4] unsigned long m_nDialogPanelOnStartDialog
      data +0x990 [sizeof=1] unsigned char m_bDialogPressedAButton
      data +0x991 [sizeof=1] unsigned char m_bEndMajorEventListenToJoin
      data +0x992 [sizeof=1] unsigned char m_bEndMajorEventPauseStatus
      data +0x993 [sizeof=1] unsigned char m_bChapterTransitionPending
      data +0x994 [sizeof=4] int m_nChapterTransition
      data +0x998 [sizeof=8] unsigned char m_szChapterTransitionResRef[8]
      data +0x9a0 [sizeof=1] unsigned char m_bTextScreenTransitionPending
      data +0x9a1 [sizeof=8] unsigned char m_szTextScreenTransitionResRef[8]
      data +0x9a9 [sizeof=1] unsigned char m_bMoviePending
      data +0x9aa [sizeof=8] unsigned char m_szMovieResRef[8]
      data +0x9b2 [sizeof=1] unsigned char m_bPendingMapWorld
      <padding> (1 bytes)
      data +0x9b4 [sizeof=4] int m_idPendingMapWorldController
      data +0x9b8 [sizeof=2] short m_nPendingMapWorldDirection
      data +0x9ba [sizeof=1] unsigned char m_bRestPending
      data +0x9bb [sizeof=1] unsigned char m_bRestRenting
      data +0x9bc [sizeof=1] unsigned char m_bRestMovie
      <padding> (3 bytes)
      data +0x9c0 [sizeof=4] int m_nRestHP
      data +0x9c4 [sizeof=4] int m_nRestGP
      data +0x9c8 [sizeof=4] long m_nBattleCryTimeOut
      data +0x9cc [sizeof=28] CTypedPtrList<CPtrList,CDeathSound *> m_deathSoundList
      data +0x9e8 [sizeof=4] long m_nPartySizeCheckStartDelay
      data +0x9ec [sizeof=1] unsigned char m_bPlayEndCredits
      data +0x9ed [sizeof=1] unsigned char m_bPendingReformParty
      data +0x9ee [sizeof=1] unsigned char m_bLeaveAreaLuaPanicPending
      <padding> (1 bytes)
      data +0x9f0 [sizeof=4] unsigned long m_ulLeaveAreaLuaPanicTimer
      data +0x9f4 [sizeof=8] CPoint m_ptLeaveAreaLuaPanicLocation
      data +0x9fc [sizeof=2] short m_nLeaveAreaLuaPanicDirection
      <padding> (2 bytes)
      data +0xa00 [sizeof=4] CString m_sLeaveAreaLuaPanicAreaName
      data +0xa04 [sizeof=4] CString m_sLeaveAreaLuaPanicParchment
      data +0xa08 [sizeof=4] unsigned long m_dwPausedTickCount
      data +0xa0c [sizeof=4] unsigned long m_dwLastDialogTickCount
      data +0xa10 [sizeof=4] long m_lastAmbiance
      data +0xa14 [sizeof=4] long m_comingOutOfDialog
      data +0xa18 [sizeof=1] unsigned char m_nAutoHideInterface
      data +0xa19 [sizeof=1] unsigned char m_nAutoUnhideInterface
      <padding> (2 bytes)
      data +0xa1c [sizeof=16] CRect m_rCurrViewPort
      data +0xa2c [sizeof=4] int m_bLeftPanel
      data +0xa30 [sizeof=4] int m_bRightPanel
      data +0xa34 [sizeof=1] unsigned char m_bCheckRestrict
      <padding> (3 bytes)
      data +0xa38 [sizeof=28] CTypedPtrList<CPtrList,long *> m_otherTalkers
      data +0xa54 [sizeof=4] long m_nInteractionBlockCnt
      data +0xa58 [sizeof=4] int m_bInteractionBlock
      data +0xa5c [sizeof=4] int m_nStateOverride
      data +0xa60 [sizeof=4] long m_nStateOverrideCnt
      data +0xa64 [sizeof=4] long m_nBlackOutCountDown
      data +0xa68 [sizeof=4] long m_nCutSceneDeadZoneCountDown
      data +0xa6c [sizeof=4] long m_nContainerOutline
      data +0xa70 [sizeof=4] int m_tutorialWaitTimer
      data +0xa74 [sizeof=4] int m_bPausedBeforeStore
      data +0xa78 [sizeof=4] long m_nPauseMessageUpdate
      data +0xa7c [sizeof=4] unsigned long m_deathStrRef
      data +0xa80 [sizeof=4] int m_bHighlightEnabled
      data +0xa84 [sizeof=4] float m_fPanStorage
      data +0xa88 [sizeof=4] int m_bViewingContainer
      data +0xa8c [sizeof=4] int m_bInDialog
      data +0xa90 [sizeof=4] int m_bDead
      data +0xa94 [sizeof=4] int m_bInCommand
      data +0xa98 [sizeof=4] int m_bPickingParty
      data +0xa9c [sizeof=4] int m_bAutoZooming
      data +0xaa0 [sizeof=4] float m_fPreviousZoom
      data +0xaa4 [sizeof=4] float m_fTargetZoom
      data +0xaa8 [sizeof=16] CRect m_rPreviousViewPort
      data +0xab8 [sizeof=8] CPoint m_ptPreviousView
      data +0xac0 [sizeof=8] CPoint m_ptTarget
      data +0xac8 [sizeof=4] int m_nZoomCurStep
      data +0xacc [sizeof=16] CRect m_rOriginalViewPort
      data +0xadc [sizeof=8] CPoint m_ptOriginalView
      data +0xae4 [sizeof=4] float m_fOriginalZoom
      data +0xae8 [sizeof=4] long* m_storedGroup
      data +0xaec [sizeof=4] int m_nStoredGroupMembers


.. _CScreenWorldMap:

CScreenWorldMap
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

      base +0x00 [sizeof=44] CBaldurEngine
      data +0x2c [sizeof=1176] CKeyInfo m_pVirtualKeys[98]
      data +0x4c4 [sizeof=392] int m_pVirtualKeysFlags[98]
      data +0x64c [sizeof=1] unsigned char m_bCtrlKeyDown
      data +0x64d [sizeof=1] unsigned char m_bShiftKeyDown
      <padding> (2 bytes)
      data +0x650 [sizeof=4] int m_bCapsLockKeyOn
      data +0x654 [sizeof=28] CPtrList m_lPopupStack
      data +0x670 [sizeof=8] CSize m_mapSize
      data +0x678 [sizeof=4] int m_nEngineState
      data +0x67c [sizeof=8] CPoint m_ptMapView
      data +0x684 [sizeof=168] CVidMosaic m_vmMap
      data +0x72c [sizeof=192] CVidCell m_vcAreas
      data +0x7ec [sizeof=192] CVidCell m_vcMarker
      data +0x8ac [sizeof=32] CVidFont m_vfLabel
      data +0x8cc [sizeof=1024] tagRGBQUAD m_aPalette[256]
      data +0xccc [sizeof=4] unsigned long m_wAreaForeground
      data +0xcd0 [sizeof=4] unsigned long m_nHighlightArea
      data +0xcd4 [sizeof=4] unsigned long m_nSelectedArea
      data +0xcd8 [sizeof=4] int m_bSelectedReachable
      data +0xcdc [sizeof=4] int m_bOverSelectedArea
      data +0xce0 [sizeof=8] CPoint m_ptMapStartMousePos
      data +0xce8 [sizeof=8] CPoint m_ptMapStartView
      data +0xcf0 [sizeof=4] int m_bMapLeftDown
      data +0xcf4 [sizeof=4] int m_bMapDragging
      data +0xcf8 [sizeof=4] CGameArea* m_pCurrentArea
      data +0xcfc [sizeof=4] long m_nLeaderSprite
      data +0xd00 [sizeof=4] CList<unsigned long,unsigned long &>* m_pPath
      data +0xd04 [sizeof=4] long m_nLeavingEdge
      data +0xd08 [sizeof=4] unsigned long m_nCurrentLink
      data +0xd0c [sizeof=8] CResRef m_cResCurrentArea
      data +0xd14 [sizeof=20] CArray<CRect,CRect &> m_aAreaRect
      data +0xd28 [sizeof=4] CUIControlTextDisplay* m_pChatDisplay
      data +0xd2c [sizeof=4] int m_nChatMessageCount
      data +0xd30 [sizeof=1] unsigned char m_bInControl
      data +0xd31 [sizeof=1] unsigned char m_bClickedArea
      <padding> (2 bytes)
      data +0xd34 [sizeof=4] int m_nCurrentSong
      data +0xd38 [sizeof=4] unsigned long m_nToolTip
      data +0xd3c [sizeof=32] CVidFont m_preLoadFontRealms
      data +0xd5c [sizeof=32] CVidFont m_preLoadFontTool
      data +0xd7c [sizeof=1] unsigned char m_nScrollState
      data +0xd7d [sizeof=8] CResRef m_rForceRandomEncounter
      <padding> (3 bytes)
      data +0xd88 [sizeof=4] CString m_sForcedEncounterEntry
      data +0xd8c [sizeof=4] int m_bFontDropShadow



.. _CScriptCache:

CScriptCache
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 4        | :ref:`CAIScript<CAIScript>`\*\*        | m_scriptMap                   |
+------------+----------+----------------------------------------+-------------------------------+
| 0x04       | 4        | long                                   | m_nTableEntries               |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

   CScriptCache         struct
     m_scriptMap        dd ? ; CAIScript** 
     m_nTableEntries    dd ?
   CScriptCache         ends


.. _CSearchBitmap:

CSearchBitmap
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 176      | :ref:`CVidBitmap<CVidBitmap>`          | m_resSearch                   |
+------------+----------+----------------------------------------+-------------------------------+
| 0xb0       | 4        | unsigned char\*                        | m_pDynamicCost                |
+------------+----------+----------------------------------------+-------------------------------+
| 0xb4       | 4        | unsigned char\*                        | m_snapshotDynamicCost         |
+------------+----------+----------------------------------------+-------------------------------+
| 0xb8       | 4        | const unsigned char\*                  | m_snapshotTerrainTable        |
+------------+----------+----------------------------------------+-------------------------------+
| 0xbc       | 8        | :ref:`CSize<CSize>`                    | m_GridSquareDimensions        |
+------------+----------+----------------------------------------+-------------------------------+
| 0xc4       | 4        | :ref:`CGameArea<CGameArea>`\*          | m_pArea                       |
+------------+----------+----------------------------------------+-------------------------------+
| 0xc8       | 1        | unsigned char                          | m_sourceSide                  |
+------------+----------+----------------------------------------+-------------------------------+
| 0xc9       | 1        | unsigned char                          | m_snapshotPersonalSpace       |
+------------+----------+----------------------------------------+-------------------------------+
|            | 2        |                                        | ``<padding>``                 |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

   CSearchBitmap             struct
     m_resSearch             CVidBitmap <>
     m_pDynamicCost          dd ? ; unsigned char* 
     m_snapshotDynamicCost   dd ? ; unsigned char* 
     m_snapshotTerrainTable  dd ? ; const unsigned char* 
     m_GridSquareDimensions  CSize <>
     m_pArea                 dd ? ; CGameArea* 
     m_sourceSide            db ?
     m_snapshotPersonalSpace db ?
                             db ? ; padding
                             db ? ; padding
   CSearchBitmap ends


.. _CSearchRequest:

CSearchRequest
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

      data +0x00 [sizeof=1] unsigned char m_serviceState
      data +0x01 [sizeof=1] unsigned char m_collisionDelay
      <padding> (2 bytes)
      data +0x04 [sizeof=4] int m_collisionSearch
      data +0x08 [sizeof=1] unsigned char m_sourceSide
      data +0x09 [sizeof=1] unsigned char m_nPartyIds
      data +0x0a [sizeof=1] unsigned char m_nTargetIds
      data +0x0b [sizeof=1] unsigned char m_nTargetPoints
      data +0x0c [sizeof=4] int m_removeSelf
      data +0x10 [sizeof=1] unsigned char m_frontList
      <padding> (3 bytes)
      data +0x14 [sizeof=4] CSearchBitmap* m_searchBitmap
      data +0x18 [sizeof=16] unsigned char m_terrainTable[16]
      data +0x28 [sizeof=4] int m_pathSmooth
      data +0x2c [sizeof=4] int m_exclusiveTargetPoints
      data +0x30 [sizeof=4] long m_sourceId
      data +0x34 [sizeof=8] tagPOINT m_sourcePt
      data +0x3c [sizeof=4] long* m_partyIds
      data +0x40 [sizeof=4] long* m_targetIds
      data +0x44 [sizeof=4] tagPOINT* m_targetPoints
      data +0x48 [sizeof=4] long m_minNodes
      data +0x4c [sizeof=4] long m_maxNodes
      data +0x50 [sizeof=4] long m_minNodesBack
      data +0x54 [sizeof=4] long m_maxNodesBack
      data +0x58 [sizeof=4] int m_bBump
      data +0x5c [sizeof=2] short m_searchRc
      data +0x5e [sizeof=2] short m_nPath
      data +0x60 [sizeof=4] long* m_pPath




.. _CSelectiveBonus:

CSelectiveBonus
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 20       | :ref:`CAIObjectType<CAIObjectType>`    | m_type                        |
+------------+----------+----------------------------------------+-------------------------------+
| 0x14       | 4        | long                                   | m_bonus                       |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

   CSelectiveBonus  struct
     m_type         CAIObjectType <>
     m_bonus        dd ?
   CSelectiveBonus  ends


.. _CSelectiveBonusList:

CSelectiveBonusList
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 28       | :ref:`CTypedPtrList<CTypedPtrList>`    | m_cTypedPtrList               |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

   CSelectiveBonusList  struct
     m_cTypedPtrList    CTypedPtrList <>
   CSelectiveBonusList  ends


.. _CSelectiveWeaponType:

CSelectiveWeaponType
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+-----------------------------------------------------+-----------+
| **Offset** | **Size** | **Type**                                            | **Field** |
+------------+----------+-----------------------------------------------------+-----------+
| 0x00       | 4        | int                                                 | m_slot    |
+------------+----------+-----------------------------------------------------+-----------+
| 0x04       | 20       | :ref:`CAIObjectType<CAIObjectType>`                 | m_type    |
+------------+----------+-----------------------------------------------------+-----------+
| 0x18       | 16       | :ref:`CWeaponIdentification<CWeaponIdentification>` | m_weapon  |
+------------+----------+-----------------------------------------------------+-----------+

Asm Definition

::

   CSelectiveWeaponType struct
     m_slot             dd ?
     m_type             CAIObjectType <>
     m_weapon           CWeaponIdentification <>
   CSelectiveWeaponType ends


.. _CSelectiveWeaponTypeList:

CSelectiveWeaponTypeList
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 28       | :ref:`CTypedPtrList<CTypedPtrList>`    | m_cTypedPtrList               |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

   CSelectiveWeaponTypeList struct
     m_cTypedPtrList        CTypedPtrList <>
   CSelectiveWeaponTypeList ends


.. _CSequenceSound:

CSequenceSound
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 8        | :ref:`CResRef<CResRef>`                | m_sound                       |
+------------+----------+----------------------------------------+-------------------------------+
| 0x08       | 4        | long                                   | m_offset                      |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

   CSequenceSound   struct
     m_sound        CResRef <>
     m_offset       dd ?
   CSequenceSound   ends


.. _CSequenceSoundList:

CSequenceSoundList
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 28       | :ref:`CTypedPtrList<CTypedPtrList>`    | m_cTypedPtrList               |
+------------+----------+----------------------------------------+-------------------------------+
| 0x1C       | 4        | __POSITION\*                           | m_currentSound                |
+------------+----------+----------------------------------------+-------------------------------+
| 0x20       | 4        | int                                    | m_soundPlaying                |
+------------+----------+----------------------------------------+-------------------------------+
| 0x24       | 4        | long                                   | m_channel                     |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

   CSequenceSoundList   struct
     m_cTypedPtrList    CTypedPtrList <>
     m_currentSound     dd ? ; __POSITION* 
     m_soundPlaying     dd ?
     m_channel          dd ?
   CSequenceSoundList   ends


.. _CSize:

CSize
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

.. note:: Actually defined as `SIZE <https://docs.microsoft.com/en-us/windows/win32/api/windef/ns-windef-size>`_ but adapted/recreated as its own structure.

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 4        | long                                   | cx                            |
+------------+----------+----------------------------------------+-------------------------------+
| 0x04       | 4        | long                                   | cy                            |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

   CSize    struct
     cx     dd ?
     cy     dd ?
   CSize    ends


.. _CSnowFlake:

CSnowFlake
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 52       | :ref:`CParticle<CParticle>`            | m_cParticle                   |
+------------+----------+----------------------------------------+-------------------------------+
| 0x34       | 1        | unsigned char                          | m_nDriftWidth                 |
+------------+----------+----------------------------------------+-------------------------------+
| 0x35       | 1        | unsigned char                          | m_nDriftCounter               |
+------------+----------+----------------------------------------+-------------------------------+
| 0x36       | 2        | unsigned short                         | m_nMeltTime                   |
+------------+----------+----------------------------------------+-------------------------------+
| 0x38       | 4        | long                                   | m_nLastDriftVelocity          |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

   CSnowFlake               struct
     m_cParticle            CParticle <>
     m_nDriftWidth          db ?
     m_nDriftCounter        db ?
     m_nMeltTime            dw ?
     m_nLastDriftVelocity   dd ?
   CSnowFlake               ends


.. _CSnowStorm:

CSnowStorm
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 4        | :ref:`CSnowFlake<CSnowFlake>`\*        | m_pSnowFlakes                 |
+------------+----------+----------------------------------------+-------------------------------+
| 0x04       | 2        | unsigned short                         | m_nCurrentDensity             |
+------------+----------+----------------------------------------+-------------------------------+
|            | 2        |                                        | ``<padding>``                 |
+------------+----------+----------------------------------------+-------------------------------+
| 0x08       | 16       | CRect                                  | m_rOldWorldViewPort           |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

   CSnowStorm               struct
     m_pSnowFlakes          dd ? ; CSnowFlake* 
     m_nCurrentDensity      dw ?
                            dw ? ; padding
     m_rOldWorldViewPort    CRect <>
   CSnowStorm               ends


.. _CSound:

CSound
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 4        | :ref:`CObject<CObject>`                | m_cObject                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x04       | 12       | :ref:`CResHelper<CResHelper>`          | m_cResHelper                  |
+------------+----------+----------------------------------------+-------------------------------+
| 0x10       | 4        | :ref:`CSoundImp<CSoundImp>`\*          | pimpl                         |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

   CSound           struct
     m_cObject      CObject <>
     m_cResHelper   CResHelper <>
     pimpl          dd ? ; CSoundImp* 
   CSound           ends


.. _CSoundChannel:

CSoundChannel
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 4        | :ref:`CObject<CObject>`                | m_cObject                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x04       | 28       | :ref:`CObList<CObList>`                | lQueue                        |
+------------+----------+----------------------------------------+-------------------------------+
| 0x20       | 4        | long                                   | m_nVolumeInit                 |
+------------+----------+----------------------------------------+-------------------------------+
| 0x24       | 4        | long                                   | nVolume                       |
+------------+----------+----------------------------------------+-------------------------------+
| 0x28       | 4        | int                                    | nType                         |
+------------+----------+----------------------------------------+-------------------------------+
| 0x2C       | 1        | bool                                   | bDucked                       |
+------------+----------+----------------------------------------+-------------------------------+
|            | 3        |                                        | ``<padding>``                 |
+------------+----------+----------------------------------------+-------------------------------+
| 0x30       | 4        | int                                    | m_nDuckingAmount              |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

   CSoundChannel        struct
     m_cObject          CObject <>
     lQueue             CObList <>
     m_nVolumeInit      dd ?
     nVolume            dd ?
     nType              dd ?
     bDucked            db ?
                        db ? ; padding
                        db ? ; padding
                        db ? ; padding 
     m_nDuckingAmount   dd ?
   CSoundChannel        ends


.. _CSoundExtensionBase:

CSoundExtensionBase
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 4        | unsigned long                          | m_nRange                      |
+------------+----------+----------------------------------------+-------------------------------+
| 0x04       | 4        | unsigned long                          | m_dwFlags                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x08       | 4        | long                                   | m_nPitchVariance              |
+------------+----------+----------------------------------------+-------------------------------+
| 0x0C       | 4        | long                                   | m_nVolumeVariance             |
+------------+----------+----------------------------------------+-------------------------------+
| 0x10       | 240      | unsigned long                          | reservedSpace[60]             |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

   CSoundExtensionBase  struct
     m_nRange           dd ?
     m_dwFlags          dd ?
     m_nPitchVariance   dd ?
     m_nVolumeVariance  dd ?
     reservedSpace      dd 60 dup (?)
   CSoundExtensionBase  ends


.. _CSoundExtensionFile:

CSoundExtensionFile
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 12       | :ref:`CResHelper<CResHelper>`          | m_cResHelper                  |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

   CSoundExtensionFile  struct
     m_cResHelper       CResHelper <>
   CSoundExtensionFile  ends


.. _CSoundImp:

CSoundImp
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

      base +0x00 [sizeof=4] CObject
      base +0x04 [sizeof=12] CResHelper<CResWave,4>
      data +0x10 [sizeof=4] CSound* m_pParent
      data +0x14 [sizeof=4] int m_bPositionedSound
      data +0x18 [sizeof=4] int m_dwBufferSize
      data +0x1c [sizeof=4] int m_dwFrequency
      data +0x20 [sizeof=4] int m_nBufferFormat
      data +0x24 [sizeof=4] int m_nRange
      data +0x28 [sizeof=4] int m_nRangeVolume
      data +0x2c [sizeof=4] int m_nXCoordinate
      data +0x30 [sizeof=4] int m_nYCoordinate
      data +0x34 [sizeof=4] int m_nZCoordinate
      data +0x38 [sizeof=4] long m_nPan
      data +0x3c [sizeof=4] long m_nVolume
      data +0x40 [sizeof=1] bool m_bSoundInitialized
      <padding> (3 bytes)
      data +0x44 [sizeof=4] int m_nChannel
      data +0x48 [sizeof=4] int m_nPriority
      data +0x4c [sizeof=4] int m_nLooping
      data +0x50 [sizeof=4] long m_nPitchVariance
      data +0x54 [sizeof=4] long m_nVolumeVariance
      data +0x58 [sizeof=1] bool m_b3DPositionning
      <padding> (3 bytes)
      data +0x5c [sizeof=4] unsigned int m_nSource
      data +0x60 [sizeof=4] unsigned int m_nBuffer
      data +0x64 [sizeof=1] bool m_bFireForget
      <padding> (3 bytes)
      data +0x68 [sizeof=4] unsigned int m_nArea
      data +0x6c [sizeof=4] int m_dwOverrideFlags
      data +0x70 [sizeof=1] bool m_bSoundIsntDucked
      <padding> (3 bytes)




.. _CSoundMixer:

CSoundMixer
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+-----------------------------------------+-----------+
| **Offset** | **Size** | **Type**                                | **Field** |
+------------+----------+-----------------------------------------+-----------+
| 0x00       | 4        | :ref:`CSoundMixerImp<CSoundMixerImp>`\* | pimpl     |
+------------+----------+-----------------------------------------+-----------+

Asm Definition

::

   CSoundMixer  struct
     pimpl      dd ? ; CSoundMixerImp* 
   CSoundMixer  ends


.. _CSoundMixerImp:

CSoundMixerImp
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

      data +0x00 [sizeof=4] ALCcontext_struct* alContext
      data +0x04 [sizeof=4] ALCdevice_struct* alDevice
      data +0x08 [sizeof=12] float pos[3]
      data +0x14 [sizeof=4] int bMixerInitialized
      data +0x18 [sizeof=4] int bStreamPlaying
      data +0x1c [sizeof=4] int m_bMusicInitialized
      data +0x20 [sizeof=4] int bInPositionUpdate
      data +0x24 [sizeof=4] int bInSoundUpdate
      data +0x28 [sizeof=4] int bInQueueUpdate
      data +0x2c [sizeof=4] int bInLoopingUpdate
      data +0x30 [sizeof=4] unsigned long m_dwEAXProperties
      data +0x34 [sizeof=16] CSoundProperties m_soundProperties
      data +0x44 [sizeof=4] int m_nNumSongs
      data +0x48 [sizeof=4] int m_nLastSong
      data +0x4c [sizeof=4] int m_nCurrentSong
      data +0x50 [sizeof=4] int m_nQuietMusicVolume
      data +0x54 [sizeof=4] unsigned int m_nActiveArea
      data +0x58 [sizeof=4] int m_nDuckingOn
      data +0x5c [sizeof=20] CDWordArray m_aMusicSlots
      data +0x70 [sizeof=10001] unsigned char m_tSqrtTable[10001]
      <padding> (3 bytes)
      data +0x2784 [sizeof=4] int nMaxVoices
      data +0x2788 [sizeof=28] CObList lVoices
      data +0x27a4 [sizeof=28] CObList lWaiting
      data +0x27c0 [sizeof=28] CObList lLooping
      data +0x27dc [sizeof=20] CObArray aChannels
      data +0x27f0 [sizeof=4] int nMaxChannels
      data +0x27f4 [sizeof=4] int nGlobalVolume
      data +0x27f8 [sizeof=4] int nPanRange
      data +0x27fc [sizeof=4] int nXCoordinate
      data +0x2800 [sizeof=4] int nYCoordinate
      data +0x2804 [sizeof=4] int nZCoordinate
      data +0x2808 [sizeof=28] CTypedPtrList<CPtrList,CMusicPosition *> m_lMusicPositions




.. _CSoundProperties:

CSoundProperties
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 16       | _EAXPRESET                             | m_iEAXpreset                  |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

   CSoundProperties struct
     m_iEAXpreset   _EAXPRESET <>
   CSoundProperties ends


.. _CSparkle:

CSparkle
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

      base +0x00 [sizeof=71] CGameObject
      <padding> (1 bytes)
      data +0x48 [sizeof=2] short m_nType
      <padding> (2 bytes)
      data +0x4c [sizeof=8] CPoint m_posExact
      data +0x54 [sizeof=8] CPoint m_posDelta
      data +0x5c [sizeof=8] CPoint m_posDest
      data +0x64 [sizeof=1] unsigned char m_moveScale
      data +0x65 [sizeof=16] unsigned char m_terrainTable[16]
      <padding> (1 bytes)
      data +0x76 [sizeof=2] short m_nConjureDuration
      data +0x78 [sizeof=4] long m_nTimer
      data +0x7c [sizeof=4] long m_destId
      data +0x80 [sizeof=4] long m_srcId
      data +0x84 [sizeof=4] CAIAction* m_pTargetAction



.. _CSparkleCluster:

CSparkleCluster
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

      base +0x00 [sizeof=71] CGameObject
      <padding> (1 bytes)
      data +0x48 [sizeof=4] CVidMode* m_pVidMode
      data +0x4c [sizeof=28] CTypedPtrList<CPtrList,CParticle *> m_particleList
      data +0x68 [sizeof=4] unsigned long m_colorStart
      data +0x6c [sizeof=4] unsigned long m_colorFade1
      data +0x70 [sizeof=4] unsigned long m_colorFade2
      data +0x74 [sizeof=4] unsigned long m_colorFade3
      data +0x78 [sizeof=4] unsigned long m_colorFade4
      data +0x7c [sizeof=1] unsigned char m_fade1Height
      data +0x7d [sizeof=1] unsigned char m_fade2Height
      data +0x7e [sizeof=1] unsigned char m_fade3Height
      data +0x7f [sizeof=1] unsigned char m_fade4Height
      data +0x80 [sizeof=16] CRect m_rBounding
      data +0x90 [sizeof=2] unsigned short m_wType
      <padding> (2 bytes)
      data +0x94 [sizeof=4] unsigned long m_nTimer
      data +0x98 [sizeof=2] unsigned short m_nConjureDuration
      <padding> (2 bytes)
      data +0x9c [sizeof=8] CPoint m_explosionDir
      data +0xa4 [sizeof=4] int m_nGravity


.. _CSpawn:

CSpawn
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

      vfptr +0x00 [sizeof=4] 
      data +0x04 [sizeof=4] unsigned int Interval
      data +0x08 [sizeof=4] CString SectionAlias
      data +0x0c [sizeof=4] unsigned long SpawnFlags
      data +0x10 [sizeof=4] int DataIsValid
      data +0x14 [sizeof=20] CAIObjectType mSearchAI
      data +0x28 [sizeof=4] int mSearchQty
      data +0x2c [sizeof=16] int mSearchRegion[4]
      data +0x3c [sizeof=4] CSpawnVar* mpSearchKeyVar
      data +0x40 [sizeof=4] CSpawnVar* mpSearchQtyVar
      data +0x44 [sizeof=28] CStringList mCREFiles
      data +0x60 [sizeof=4] int mCreateQty
      data +0x64 [sizeof=4] CString* mpCreateQtyScope
      data +0x68 [sizeof=4] CString* mpCreateQtyLabel
      data +0x6c [sizeof=4] CString* mpScriptName
      data +0x70 [sizeof=1] unsigned char mEA
      data +0x71 [sizeof=1] unsigned char mGeneral
      data +0x72 [sizeof=1] unsigned char mRace
      data +0x73 [sizeof=1] unsigned char mClass
      data +0x74 [sizeof=1] unsigned char mGender
      data +0x75 [sizeof=1] unsigned char mSpecifics
      data +0x76 [sizeof=1] unsigned char mFaction
      data +0x77 [sizeof=1] unsigned char mTeam
      data +0x78 [sizeof=1] unsigned char mAlignment
      <padding> (3 bytes)
      data +0x7c [sizeof=4] CString* mpOverrideScript
      data +0x80 [sizeof=4] CString* mpClassScript
      data +0x84 [sizeof=4] CString* mpRaceScript
      data +0x88 [sizeof=4] CString* mpGeneralScript
      data +0x8c [sizeof=4] CString* mpDefaultScript
      data +0x90 [sizeof=4] CString* mpAreaScript
      data +0x94 [sizeof=4] CString* mpSpecificsScript
      data +0x98 [sizeof=28] CStringList mDialogFiles
      data +0xb4 [sizeof=4] int mDeathGoodModifier
      data +0xb8 [sizeof=4] int mDeathLawModifier
      data +0xbc [sizeof=4] int mDeathLadyModifier
      data +0xc0 [sizeof=4] int mDeathMurderModifier
      data +0xc4 [sizeof=4] int Facing
      data +0xc8 [sizeof=24] CSpawnPointArray mSpawnPointArray
      data +0xe0 [sizeof=16] CSpawnPoint mSpelectedPoint
      data +0xf0 [sizeof=4] CSpawn::ePMode mPointSelectMode
      data +0xf4 [sizeof=4] CString* pPointIndexScope
      data +0xf8 [sizeof=4] CString* pPointIndexLabel
      data +0xfc [sizeof=4] CSpawnPointVar* mpExplicitSpawnPoint
      data +0x100 [sizeof=4] CString* pExplicitSpawnFacingScope
      data +0x104 [sizeof=4] CString* pExplicitSpawnFacingLabel
      data +0x108 [sizeof=4] CSpawnPointVar* mpSpawnPointStorage
      data +0x10c [sizeof=4] CString* pSpawnFacingStorageScope
      data +0x110 [sizeof=4] CString* pSpawnFacingStorageLabel
      data +0x114 [sizeof=4] int mSequentialStartValue
      data +0x118 [sizeof=4] unsigned long mTimeOfDay






.. _CSpawnFile:

CSpawnFile
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 28       | :ref:`CTypedPtrList<CTypedPtrList>`    | m_cTypedPtrList               |
+------------+----------+----------------------------------------+-------------------------------+
| 0x1C       | 4        | :ref:`CSpawnList<CSpawnList>`\*        | mpExitList                    |
+------------+----------+----------------------------------------+-------------------------------+
| 0x20       | 4        | :ref:`CSpawnList<CSpawnList>`\*        | mpEnterList                   |
+------------+----------+----------------------------------------+-------------------------------+
| 0x24       | 4        | int                                    | m_bInSpawn                    |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

   CSpawnFile           struct
     m_cTypedPtrList    CTypedPtrList <>
     mpExitList         dd ? ; CSpawnList* 
     mpEnterList        dd ? ; CSpawnList* 
     m_bInSpawn         dd ?
   CSpawnFile           ends


.. _CSpawnList:

CSpawnList
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 28       | :ref:`CTypedPtrList<CTypedPtrList>`    | m_cTypedPtrList               |
+------------+----------+----------------------------------------+-------------------------------+
| 0x1C       | 4        | :ref:`CString<CString>`                | mSectionAlias                 |
+------------+----------+----------------------------------------+-------------------------------+
| 0x20       | 4        | int                                    | ReceivedFirstSpawnCall        |
+------------+----------+----------------------------------------+-------------------------------+
| 0x24       | 4        | unsigned long                          | LastSpawnTime                 |
+------------+----------+----------------------------------------+-------------------------------+
| 0x28       | 4        | int                                    | CheckSpawnTimes               |
+------------+----------+----------------------------------------+-------------------------------+
| 0x2C       | 4        | unsigned long                          | SpawnTimeOfDay                |
+------------+----------+----------------------------------------+-------------------------------+
| 0x30       | 4        | unsigned int                           | mInterval                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x34       | 4        | :ref:`CSpawnVar<CSpawnVar>`\*          | pControlVar                   |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

   CSpawnList               struct
     m_cTypedPtrList        CTypedPtrList <>
     mSectionAlias          CString <>
     ReceivedFirstSpawnCall dd ?
     LastSpawnTime          dd ?
     CheckSpawnTimes        dd ?
     SpawnTimeOfDay         dd ?
     mInterval              dd ?
     pControlVar            dd ? ; CSpawnVar* 
   CSpawnList               ends


.. _CSpawnPoint:

CSpawnPoint
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 4        | vfptr                                  | vfptr                         |
+------------+----------+----------------------------------------+-------------------------------+
| 0x04       | 8        | :ref:`CPoint<CPoint>`                  | mLocation                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x0c       | 4        | int                                    | mFacing                       |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

   CSpawnPoint  struct
     vfptr      dd ?
     mLocation  CPoint  <>
     mFacing    dd ?
   CSpawnPoint  ends


.. _CSpawnPointArray:

CSpawnPointArray
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 20       | :ref:`CTypedPtrArray<CTypedPtrArray>`  | m_cTypedPtrArray              |
+------------+----------+----------------------------------------+-------------------------------+
| 0x14       | 4        | int                                    | mDefaultFacing                |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

   CSpawnPointArray     struct
     m_cTypedPtrArray   CTypedPtrArray <>
     mDefaultFacing     dd ?
   CSpawnPointArray     ends


.. _CSpawnPointVar:

CSpawnPointVar
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 8        | :ref:`CSpawnVar<CSpawnVar>`            | m_cSpawnVar                   |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

   CSpawnPointVar   struct
     m_cSpawnVar    CSpawnVar <>
   CSpawnPointVar   ends


.. _CSpawnVar:

CSpawnVar
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 4        | :ref:`CString<CString>`                | mScope                        |
+------------+----------+----------------------------------------+-------------------------------+
| 0x04       | 4        | :ref:`CString<CString>`                | mLabel                        |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

   CSpawnVar        struct
     mScope         CString <>
     mLabelmScope   CString <>
   CSpawnVar        ends


.. _CSpell:

CSpell
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 12       | :ref:`CResHelper<CResHelper>`          | m_cResHelper                  |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

   CSpell           struct
     m_cResHelper   CResHelper <>
   CSpell           ends


.. _CSpellLevelDecrementing:

CSpellLevelDecrementing
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 4        | int                                    | m_bImmune                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x04       | 4        | long                                   | m_nLevels                     |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

   CSpellLevelDecrementing struct
     m_bImmune             dd ?
     m_nLevels             dd ?
   CSpellLevelDecrementing ends


.. _CSteam:

CSteam
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

      data +0x00 [sizeof=1] bool m_isSteamConnected
      data +0x01 [sizeof=8] CSteamID m_SteamID
      <padding> (7 bytes)
      data +0x10 [sizeof=32] CCallResult<CSteam,CreateItemResult_t> m_CreateItemCompleted
      data +0x30 [sizeof=32] CCallResult<CSteam,SteamUGCQueryCompleted_t> m_PublishedQueryCompleted
      data +0x50 [sizeof=32] CCallResult<CSteam,SubmitItemUpdateResult_t> m_SubmitItemUpdateCompleted
      data +0x70 [sizeof=4] int m_RemainingPublished
      data +0x74 [sizeof=4] int m_CurPagePublished
      data +0x78 [sizeof=4] CString m_PublishingName
      data +0x7c [sizeof=4] CString m_PublishingDir
      data +0x80 [sizeof=4] int m_CloudState
      <padding> (4 bytes)
      data +0x88 [sizeof=32] CCallResult<CSteam,SteamUGCRequestUGCDetailsResult_t> m_RequestUGCDetailsCompleted
      data +0xa8 [sizeof=136] CSteam::SubscribedItems m_Subscribed
      data +0x130 [sizeof=8] unsigned __int64 m_nUploadId
      data +0x138 [sizeof=4] ISteamRemoteStorage* m_RemoteStorage
      data +0x13c [sizeof=4] ISteamUGC* m_UGC
      data +0x140 [sizeof=4] ISteamUserStats* m_UserStats
      data +0x144 [sizeof=4] void  (__cdecl * logger)(const char*, ...)


.. _CSteamIDSubscribedItems:

CSteam::SubscribedItems
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 128      | unsigned __int64                       | vecPublished[16]              |
+------------+----------+----------------------------------------+-------------------------------+
| 0x80       | 4        | int                                    | curSubscribed                 |
+------------+----------+----------------------------------------+-------------------------------+
| 0x84       | 4        | int                                    | numSubscribed                 |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

      data +0x00 [sizeof=128] unsigned __int64 vecPublished[16]
      data +0x80 [sizeof=4] int curSubscribed
      data +0x84 [sizeof=4] int numSubscribed


.. _CSteamID:

CSteamID
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 8        | CSteamID::SteamID_t                    | m_steamid                     |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

      data +0x00 [sizeof=8] CSteamID::SteamID_t m_steamid


.. _CSteamIDSteamID:

CSteamID::SteamID_t
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+------------------------------------------------+-----------+
| **Offset** | **Size** | **Type**                                       | **Field** |
+------------+----------+------------------------------------------------+-----------+
| 0x00       |          | CSteamID::SteamID_t::SteamIDComponent_t        | m_comp    |
+------------+----------+------------------------------------------------+-----------+

Asm Definition

::

      data +0x00 [sizeof=8] CSteamID::SteamID_t::SteamIDComponent_t m_comp
      data +0x00 [sizeof=8] unsigned __int64 m_unAll64Bits


.. _CSteamIDSteamIDSteamIDComponent:

CSteamID::SteamID_t::SteamIDComponent_t
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 4        | unsigned int                           | m_unAccountID : 32            |
+------------+----------+----------------------------------------+-------------------------------+
| 0x04       | 4        | unsigned int                           | m_unAccountInstance : 20      |
+------------+----------+----------------------------------------+-------------------------------+
| 0x04       | 4        | unsigned int                           | m_EAccountType : 4            |
+------------+----------+----------------------------------------+-------------------------------+
| 0x04       | 4        | EUniverse                              | m_EUniverse : 8               |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

      data +0x00 [sizeof=4] unsigned int m_unAccountID : 32
      data +0x04 [sizeof=4] unsigned int m_unAccountInstance : 20
      data +0x04 [sizeof=4] unsigned int m_EAccountType : 4
      data +0x04 [sizeof=4] EUniverse m_EUniverse : 8


.. _CStore:

CStore
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

      data +0x00 [sizeof=8] CResRef m_resRef
      data +0x08 [sizeof=148] CStoreFileHeader m_header
      data +0x9c [sizeof=28] CTypedPtrList<CPtrList,CStoreFileItem *> m_lInventory
      data +0xb8 [sizeof=4] unsigned long* m_pBuyTypes
      data +0xbc [sizeof=4] unsigned long m_nBuyTypes
      data +0xc0 [sizeof=4] CStoreFileDrinks* m_pDrinks
      data +0xc4 [sizeof=4] unsigned long m_nDrinks
      data +0xc8 [sizeof=4] CStoreFileSpell* m_pSpells
      data +0xcc [sizeof=4] unsigned long m_nSpells
      data +0xd0 [sizeof=8] unsigned char m_pVersion[8]
      data +0xd8 [sizeof=4] int m_bLocalCopy



.. _CStoreFile:

CStoreFile
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 12       | :ref:`CResHelper<CResHelper>`          | m_cResHelper                  |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

   CStoreFile       struct
     m_cResHelper   CResHelper <>
   CStoreFile       ends


.. _CStoreFileDrinks:

CStoreFileDrinks
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 8        | unsigned char                          | m_icon[8]                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x08       | 4        | unsigned long                          | m_strName                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x0C       | 4        | unsigned long                          | m_nCost                       |
+------------+----------+----------------------------------------+-------------------------------+
| 0x10       | 4        | unsigned long                          | m_nRumorChance                |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

   CStoreFileDrinks struct
     m_icon         db 8 dup (?)
     m_strName      dd ?
     m_nCost        dd ?
     m_nRumorChance dd ?
   CStoreFileDrinks ends


.. _CStoreFileHeader:

CStoreFileHeader
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

      data +0x00 [sizeof=4] unsigned long m_nStoreType
      data +0x04 [sizeof=4] unsigned long m_strName
      data +0x08 [sizeof=4] unsigned long m_nStoreFlags
      data +0x0c [sizeof=4] unsigned long m_nBuyMarkUp
      data +0x10 [sizeof=4] unsigned long m_nSellMarkDown
      data +0x14 [sizeof=4] unsigned long m_nAdditionalMarkDown
      data +0x18 [sizeof=2] unsigned short m_nStealDifficulty
      data +0x1a [sizeof=2] unsigned short m_nMaxItems
      data +0x1c [sizeof=8] unsigned char m_script[8]
      data +0x24 [sizeof=4] unsigned long m_nbuyTypesOffset
      data +0x28 [sizeof=4] unsigned long m_nbuyTypesCount
      data +0x2c [sizeof=4] unsigned long m_nInventoryOffset
      data +0x30 [sizeof=4] unsigned long m_nInventoryCount
      data +0x34 [sizeof=4] unsigned long m_nLore
      data +0x38 [sizeof=4] unsigned long m_nIdentifyCost
      data +0x3c [sizeof=8] unsigned char m_resRumor[8]
      data +0x44 [sizeof=4] unsigned long m_drinkOffset
      data +0x48 [sizeof=4] unsigned long m_drinkCount
      data +0x4c [sizeof=8] unsigned char m_resDonation[8]
      data +0x54 [sizeof=4] unsigned long m_nInnFlags
      data +0x58 [sizeof=4] unsigned long m_nRoomCostPeasant
      data +0x5c [sizeof=4] unsigned long m_nRoomCostMerchant
      data +0x60 [sizeof=4] unsigned long m_nRoomCostNoble
      data +0x64 [sizeof=4] unsigned long m_nRoomCostRoyal
      data +0x68 [sizeof=4] unsigned long m_spellOffset
      data +0x6c [sizeof=4] unsigned long m_spellCount
      data +0x70 [sizeof=4] unsigned long m_rouletMaxBet
      data +0x74 [sizeof=4] unsigned long m_crapsMaxBet
      data +0x78 [sizeof=4] unsigned long m_wheelMaxBet
      data +0x7c [sizeof=4] unsigned long m_rouletWinChance
      data +0x80 [sizeof=4] unsigned long m_crapsWinChance
      data +0x84 [sizeof=4] unsigned long m_wheelWinChance
      data +0x88 [sizeof=4] unsigned long m_rouletWinAmount
      data +0x8c [sizeof=4] unsigned long m_crapsWinAmount
      data +0x90 [sizeof=4] unsigned long m_wheelWinAmount


.. _CStoreFileItem:

CStoreFileItem
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 8        | unsigned char                          | m_itemId[8]                   |
+------------+----------+----------------------------------------+-------------------------------+
| 0x08       | 2        | unsigned short                         | m_wear                        |
+------------+----------+----------------------------------------+-------------------------------+
| 0x0A       | 6        | unsigned short                         | m_usageCount[3]               |
