.. _CG Structures:

==========================
CG Structures
==========================

.. toctree::
   :maxdepth: 2
   :hidden:
   
   CGameEffect/index


* :ref:`CGameAIArea<CGameAIArea>`
* :ref:`CGameAIBase<CGameAIBase>`
* :ref:`CGameAIGame<CGameAIGame>`
* :ref:`CGameAbilityList<CGameAbilityList>`
* :ref:`CGameAddMapNote<CGameAddMapNote>`
* :ref:`CGameAnimation<CGameAnimation>`
* :ref:`CGameAnimationType<CGameAnimationType>`
* :ref:`CGameAnimationTypeAmbient<CGameAnimationTypeAmbient>`
* :ref:`CGameAnimationTypeAmbientStatic<CGameAnimationTypeAmbientStatic>`
* :ref:`CGameAnimationTypeCharacter<CGameAnimationTypeCharacter>`
* :ref:`CGameAnimationTypeCharacterOld<CGameAnimationTypeCharacterOld>`
* :ref:`CGameAnimationTypeEffect<CGameAnimationTypeEffect>`
* :ref:`CGameAnimationTypeFlying<CGameAnimationTypeFlying>`
* :ref:`CGameAnimationTypeMonster<CGameAnimationTypeMonster>`
* :ref:`CGameAnimationTypeMonsterAnkheg<CGameAnimationTypeMonsterAnkheg>`
* :ref:`CGameAnimationTypeMonsterIcewind<CGameAnimationTypeMonsterIcewind>`
* :ref:`CGameAnimationTypeMonsterLarge<CGameAnimationTypeMonsterLarge>`
* :ref:`CGameAnimationTypeMonsterLarge16<CGameAnimationTypeMonsterLarge16>`
* :ref:`CGameAnimationTypeMonsterLayered<CGameAnimationTypeMonsterLayered>`
* :ref:`CGameAnimationTypeMonsterLayeredSpell<CGameAnimationTypeMonsterLayeredSpell>`
* :ref:`CGameAnimationTypeMonsterMulti<CGameAnimationTypeMonsterMulti>`
* :ref:`CGameAnimationTypeMonsterMultiNew<CGameAnimationTypeMonsterMultiNew>`

|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

      base +0x00 [sizeof=1020] CGameAIBase
      data +0x3fc [sizeof=16] CRect m_rBounding
      data +0x40c [sizeof=4] CPoint* m_pPolygon
      data +0x410 [sizeof=2] unsigned short m_nPolygon
      <padding> (2 bytes)
      data +0x414 [sizeof=28] CTypedPtrList<CPtrList,CItem *> m_lstItems
      data +0x430 [sizeof=2] unsigned short m_containerType
      <padding> (2 bytes)
      data +0x434 [sizeof=8] CPoint m_ptWalkToUse
      data +0x43c [sizeof=576] CVidCell m_pileVidCell[3]
      data +0x67c [sizeof=1] unsigned char m_nPileVidCell
      data +0x67d [sizeof=1] unsigned char m_bDeleteMe
      data +0x67e [sizeof=8] unsigned char m_scriptRes[8]
      data +0x686 [sizeof=2] unsigned short m_lockDifficulty
      data +0x688 [sizeof=4] unsigned long m_dwFlags
      data +0x68c [sizeof=2] unsigned short m_trapDetectionDifficulty
      data +0x68e [sizeof=2] unsigned short m_trapRemovalDifficulty
      data +0x690 [sizeof=2] unsigned short m_trapActivated
      data +0x692 [sizeof=2] unsigned short m_trapDetected
      data +0x694 [sizeof=8] CPoint m_posTrapOrigin
      data +0x69c [sizeof=2] unsigned short m_triggerRange
      data +0x69e [sizeof=32] char m_ownedBy[32]
      data +0x6be [sizeof=8] CResRef m_keyType
      <padding> (2 bytes)
      data +0x6c8 [sizeof=4] unsigned long m_breakDifficulty
      data +0x6cc [sizeof=2] short m_drawPoly
      <padding> (2 bytes)
      data +0x6d0 [sizeof=4] unsigned long m_strNotPickable
      data +0x6d4 [sizeof=4] int m_bJustCreated
      data +0x6d8 [sizeof=4] int m_bNeedUpdate





.. _CGameDialogEntry:

CGameDialogEntry
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 20       | :ref:`CTypedPtrArray<CTypedPtrArray>`  | m_cGameDialogReplyArray       |
+------------+----------+----------------------------------------+-------------------------------+
| 0x14       | 4        | unsigned long                          | m_dialogText                  |
+------------+----------+----------------------------------------+-------------------------------+
| 0x18       | 28       | :ref:`CAICondition<CAICondition>`      | m_startCondition              |
+------------+----------+----------------------------------------+-------------------------------+
| 0x34       | 4        | int                                    | m_picked                      |
+------------+----------+----------------------------------------+-------------------------------+
| 0x38       | 4        | unsigned long                          | m_conditionPriority           |
+------------+----------+----------------------------------------+-------------------------------+
| 0x3C       | 4        | unsigned long                          | m_dialogIndex                 |
+------------+----------+----------------------------------------+-------------------------------+
| 0x40       | 1        | unsigned char                          | m_bDisplayButton              |
+------------+----------+----------------------------------------+-------------------------------+
|            | 3        |                                        | ``<padding>``                 |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

   CGameDialogEntry             struct
     m_cGameDialogReplyArray    CTypedPtrArray <>
     m_dialogText               dd ?
     m_startCondition           CAICondition <>
     m_picked                   dd ?
     m_conditionPriority        dd ?
     m_dialogIndex              dd ?
     m_bDisplayButton           db ?
                                db ? ; padding
                                db ? ; padding
                                db ? ; padding
   CGameDialogEntry             ends


.. _CGameDialogIdentifier:

CGameDialogIdentifier
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 8        | :ref:`CResRef<CResRef>`                | m_dialog                      |
+------------+----------+----------------------------------------+-------------------------------+
| 0x08       | 4        | unsigned long                          | m_index                       |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

   CGameDialogIdentifier    struct
     m_dialog               CResRef <>
     m_index                dd ?
   CGameDialogIdentifier    ends


.. _CGameDialogReply:

CGameDialogReply
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 4        | unsigned long                          | m_flags                       |
+------------+----------+----------------------------------------+-------------------------------+
| 0x04       | 4        | unsigned long                          | m_replyText                   |
+------------+----------+----------------------------------------+-------------------------------+
| 0x08       | 4        | unsigned long                          | m_journalEntry                |
+------------+----------+----------------------------------------+-------------------------------+
| 0x0C       | 28       | :ref:`CAICondition<CAICondition>`      | m_condition                   |
+------------+----------+----------------------------------------+-------------------------------+
| 0x28       | 36       | :ref:`CAIResponse<CAIResponse>`        | m_response                    |
+------------+----------+----------------------------------------+-------------------------------+
| 0x4C       | 8        | :ref:`CResRef<CResRef>`                | m_nextDialog                  |
+------------+----------+----------------------------------------+-------------------------------+
| 0x54       | 4        | unsigned long                          | m_nextEntryIndex              |
+------------+----------+----------------------------------------+-------------------------------+
| 0x58       | 4        | __POSITION\*                           | m_displayPosition             |
+------------+----------+----------------------------------------+-------------------------------+
| 0x5C       | 4        | int                                    | m_removeIfPicked              |
+------------+----------+----------------------------------------+-------------------------------+
| 0x60       | 1        | unsigned char                          | m_displayListId               |
+------------+----------+----------------------------------------+-------------------------------+
|            | 3        |                                        | ``<padding>``                 |
+------------+----------+----------------------------------------+-------------------------------+
| 0x64       | 4        | :ref:`CString<CString>`                | m_conditionString             |
+------------+----------+----------------------------------------+-------------------------------+
| 0x68       | 4        | int                                    | m_needToParseCondition        |
+------------+----------+----------------------------------------+-------------------------------+
| 0x6C       | 4        | :ref:`CString<CString>`                | m_responseString              |
+------------+----------+----------------------------------------+-------------------------------+
| 0x70       | 4        | int                                    | m_needToParseResponse         |
+------------+----------+----------------------------------------+-------------------------------+
| 0x74       | 4        | int                                    | m_bracketedActions            |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

   CGameDialogReply         struct
     m_flags                dd ?
     m_replyText            dd ?
     m_journalEntry         dd ?
     m_condition            CAICondition <>
     m_response             CAIResponse <>
     m_nextDialog           CResRef <>
     m_nextEntryIndex       dd ?
     m_displayPosition      dd ? ; __POSITION*
     m_removeIfPicked       dd ?
     m_displayListId        db ?
                            db ? ; padding
                            db ? ; padding
                            db ? ; padding
     m_conditionString      CString <>
     m_needToParseCondition dd ?
     m_responseString       CString <>
     m_needToParseResponse  dd ?
     m_bracketedActions     dd ?
   CGameDialogReply         ends


.. _CGameDialogSprite:

CGameDialogSprite
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 8        | :ref:`CResRef<CResRef>`                | m_file                        |
+------------+----------+----------------------------------------+-------------------------------+
| 0x08       | 20       | :ref:`CTypedPtrArray<CTypedPtrArray>`  | m_dialogEntries               |
+------------+----------+----------------------------------------+-------------------------------+
| 0x1C       | 20       | :ref:`CTypedPtrArray<CTypedPtrArray>`  | m_dialogEntriesOrdered        |
+------------+----------+----------------------------------------+-------------------------------+
| 0x30       | 4        | long                                   | m_characterIndex              |
+------------+----------+----------------------------------------+-------------------------------+
| 0x34       | 4        | long                                   | m_talkerIndex                 |
+------------+----------+----------------------------------------+-------------------------------+
| 0x38       | 4        | unsigned long                          | m_currentEntryIndex           |
+------------+----------+----------------------------------------+-------------------------------+
| 0x3C       | 4        | int                                    | m_waitingForResponse          |
+------------+----------+----------------------------------------+-------------------------------+
| 0x40       | 4        | long                                   | m_responseMarker              |
+------------+----------+----------------------------------------+-------------------------------+
| 0x44       | 4        | unsigned long                          | m_playerColor                 |
+------------+----------+----------------------------------------+-------------------------------+
| 0x48       | 4        | :ref:`CString<CString>`                | m_playerName                  |
+------------+----------+----------------------------------------+-------------------------------+
| 0x4C       | 4        | long                                   | m_dialogFreezeCounter         |
+------------+----------+----------------------------------------+-------------------------------+
| 0x50       | 4        | long                                   | m_dialogFreezeMultiplayer     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x54       | 4        | unsigned long                          | m_dWFlags                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x58       | 4        | int                                    | m_bPlayedStartSound           |
+------------+----------+----------------------------------------+-------------------------------+
| 0x5C       | 4        | int                                    | m_bItemDialog                 |
+------------+----------+----------------------------------------+-------------------------------+
| 0x60       | 4        | int                                    | m_bSuppressName               |
+------------+----------+----------------------------------------+-------------------------------+
| 0x64       | 4        | long                                   | m_UpdateTime                  |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

   CGameDialogSprite            struct
     m_file                     CResRef <>
     m_dialogEntries            CTypedPtrArray <>
     m_dialogEntriesOrdered     CTypedPtrArray <>
     m_characterIndex           dd ?
     m_talkerIndex              dd ?
     m_currentEntryIndex        dd ?
     m_waitingForResponse       dd ?
     m_responseMarker           dd ?
     m_playerColor              dd ?
     m_playerName               CString <>
     m_dialogFreezeCounter      dd ?
     m_dialogFreezeMultiplayer  dd ?
     m_dWFlags                  dd ?
     m_bPlayedStartSound        dd ?
     m_bItemDialog              dd ?
     m_bSuppressName            dd ?
     m_UpdateTime               dd ?
   CGameDialogSprite            ends


.. _CGameDoor:

CGameDoor
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

      base +0x00 [sizeof=1020] CGameAIBase
      data +0x3fc [sizeof=8] CResRef m_resID
      data +0x404 [sizeof=16] CRect m_rOpenBounding
      data +0x414 [sizeof=16] CRect m_rClosedBounding
      data +0x424 [sizeof=4] unsigned long m_cursorType
      data +0x428 [sizeof=4] unsigned long m_dwFlags
      data +0x42c [sizeof=4] CPoint* m_pOpenPolygon
      data +0x430 [sizeof=2] unsigned short m_nOpenPolygon
      <padding> (2 bytes)
      data +0x434 [sizeof=4] CPoint* m_pClosedPolygon
      data +0x438 [sizeof=2] unsigned short m_nClosedPolygon
      <padding> (2 bytes)
      data +0x43c [sizeof=4] CPoint* m_pOpenSearch
      data +0x440 [sizeof=2] unsigned short m_nOpenSearch
      <padding> (2 bytes)
      data +0x444 [sizeof=4] CPoint* m_pClosedSearch
      data +0x448 [sizeof=2] unsigned short m_nClosedSearch
      <padding> (2 bytes)
      data +0x44c [sizeof=8] CPoint m_ptDest1
      data +0x454 [sizeof=8] CPoint m_ptDest2
      data +0x45c [sizeof=8] unsigned char m_scriptRes[8]
      data +0x464 [sizeof=24] CTiledObject m_tiledObject
      data +0x47c [sizeof=32] char m_scriptName[32]
      data +0x49c [sizeof=32] char m_triggerName[32]
      data +0x4bc [sizeof=2] short m_hitPoints
      data +0x4be [sizeof=2] short m_armourClass
      data +0x4c0 [sizeof=8] CResRef m_openSound
      data +0x4c8 [sizeof=8] CResRef m_closeSound
      data +0x4d0 [sizeof=2] unsigned short m_trapDetectionDifficulty
      data +0x4d2 [sizeof=2] unsigned short m_trapDisarmingDifficulty
      data +0x4d4 [sizeof=2] unsigned short m_trapActivated
      data +0x4d6 [sizeof=2] unsigned short m_trapDetected
      data +0x4d8 [sizeof=2] unsigned short m_posXTrapOrigin
      data +0x4da [sizeof=2] unsigned short m_posYTrapOrigin
      data +0x4dc [sizeof=8] CResRef m_keyType
      data +0x4e4 [sizeof=4] unsigned long m_detectionDifficulty
      data +0x4e8 [sizeof=4] unsigned long m_lockDifficulty
      data +0x4ec [sizeof=2] short m_drawPoly
      <padding> (2 bytes)
      data +0x4f0 [sizeof=8] CPoint m_ptOpenDest
      data +0x4f8 [sizeof=8] CPoint m_ptClosedDest
      data +0x500 [sizeof=20] CSound m_sndDoor
      data +0x514 [sizeof=4] unsigned long m_strNotPickable
      data +0x518 [sizeof=4] long m_usedDelay



.. _CGameFile:

CGameFile
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 12       | :ref:`CResHelper<CResHelper>`          | m_cResGame                    |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

   CGameFile    struct
     m_cResGame CResHelper <>
   CGameFile    ends


.. _CGameFireball3d:

CGameFireball3d
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

      base +0x00 [sizeof=71] CGameObject
      <padding> (1 bytes)
      data +0x48 [sizeof=16] unsigned char m_terrainTable[16]
      data +0x58 [sizeof=16] unsigned char m_visibleTerrainTable[16]
      data +0x68 [sizeof=2] unsigned short m_animationID
      data +0x6a [sizeof=2] unsigned short m_animationIDStatic
      data +0x6c [sizeof=7] unsigned char m_colorRangeValues[7]
      <padding> (1 bytes)
      data +0x74 [sizeof=2] unsigned short m_ringGranularity
      <padding> (2 bytes)
      data +0x78 [sizeof=192] CVidCell m_spriteSplashVidCell
      data +0x138 [sizeof=36] CVidPalette m_spriteSplashPalette
      data +0x15c [sizeof=2] short m_holdDuration
      <padding> (2 bytes)
      data +0x160 [sizeof=4] int m_radius
      data +0x164 [sizeof=4] int m_speed
      data +0x168 [sizeof=1] unsigned char m_duration
      data +0x169 [sizeof=1] unsigned char m_collision
      <padding> (2 bytes)
      data +0x16c [sizeof=8] CSize m_ellipseSize
      data +0x174 [sizeof=4] unsigned char* m_pPlacementGrid
      data +0x178 [sizeof=8] CPoint m_nEllipse
      data +0x180 [sizeof=4] CRect* m_pEllipse
      data +0x184 [sizeof=4] unsigned char* m_flagEllipse
      data +0x188 [sizeof=20] CSound m_sndExplosion
      data +0x19c [sizeof=4] CString m_sSoundTemporal
      data +0x1a0 [sizeof=4] int m_bCenterSoundLooping
      data +0x1a4 [sizeof=4] int m_bSplashGlow
      data +0x1a8 [sizeof=4] int m_bBrightest
      data +0x1ac [sizeof=4] int m_bRingTemporals
      data +0x1b0 [sizeof=4] int m_bInteriorTemporals
      data +0x1b4 [sizeof=4] int m_bRandomSpeed
      data +0x1b8 [sizeof=4] int m_bPalettedRing
      data +0x1bc [sizeof=4] int m_bPalettedArea
      data +0x1c0 [sizeof=4] int m_bCone
      data +0x1c4 [sizeof=2] unsigned short m_coneSize
      <padding> (2 bytes)
      data +0x1c8 [sizeof=8] CPoint m_posEdge
      data +0x1d0 [sizeof=4] int m_bNewPalette
      data +0x1d4 [sizeof=176] CVidBitmap m_newPalette
      data +0x284 [sizeof=8] CResRef m_fireBallArea
      data +0x28c [sizeof=8] CResRef m_fireBallRing
      data +0x294 [sizeof=2] unsigned short m_projectileType
      <padding> (2 bytes)
      data +0x298 [sizeof=4] int m_bPermanent
      data +0x29c [sizeof=4] int m_bCanSave









.. _CGameID:

CGameID
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+---------------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                                    | **Field**                     |
+------------+----------+---------------------------------------------+-------------------------------+
| 0x00       | 8        | unsigned __int64                            | m_ulGameID                    |
+------------+----------+---------------------------------------------+-------------------------------+
| 0x00       | 8        | :ref:`CGameID\:\:GameID_t<CGameIDGameID_t>` | m_gameID                      |
+------------+----------+---------------------------------------------+-------------------------------+

Asm Definition

::

   CGameID          struct
     union
       m_ulGameID   dq ? ; unsigned __int64 
       m_gameID     CGameIDGameID_t <> ; CGameID::GameID_t 
     ends
   CGameID          ends


.. _CGameIDGameID_t:

CGameID\:\:GameID_t
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 4        | unsigned int                           | m_nAppID : 24                 |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 4        | unsigned int                           | m_nType : 8                   |
+------------+----------+----------------------------------------+-------------------------------+
| 0x04       | 4        | unsigned int                           | m_nModID : 32                 |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

   CGameIDGameID_t  struct
     _gameid RECORD
       m_nAppID:    24,
       m_nType:     8,
       m_nModID:    32
   CGameIDGameID_t  ends


.. _CGameJournal:

CGameJournal
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 20       | :ref:`CTypedPtrArray<CTypedPtrArray>`  | m_aChapters                 |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

   CGameJournal  struct
     m_aChapters CTypedPtrArray <>
   CGameJournal  ends


.. _CGameJournalAlphabetizer:

CGameJournalAlphabetizer
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+-----------------------------------------------+------------------+
| **Offset** | **Size** | **Type**                                      | **Field**        |
+------------+----------+-----------------------------------------------+------------------+
| 0x00       | 4        | :ref:`CGameJournalEntry<CGameJournalEntry>`\* | pEntry           |
+------------+----------+-----------------------------------------------+------------------+
| 0x04       | 4        | :ref:`CString<CString>`                       | stText           |
+------------+----------+-----------------------------------------------+------------------+

Asm Definition

::

   CGameJournalAlphabetizer struct
     pEntry                 dd ? ; CGameJournalEntry*
     stText                 CString  <>
   CGameJournalAlphabetizer ends


.. _CGameJournalEntry:

CGameJournalEntry
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+-----------------------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                                            | **Field**                     |
+------------+----------+-----------------------------------------------------+-------------------------------+
| 0x00       | 4        | unsigned long                                       | m_strText                     |
+------------+----------+-----------------------------------------------------+-------------------------------+
| 0x04       | 4        | long                                                | m_nTime                       |
+------------+----------+-----------------------------------------------------+-------------------------------+
| 0x08       | 4        | :ref:`CGameJournalEntryFlag<CGameJournalEntryFlag>` | m_Flag                        |
+------------+----------+-----------------------------------------------------+-------------------------------+
| 0x0C       | 2        | unsigned short                                      | m_wType                       |
+------------+----------+-----------------------------------------------------+-------------------------------+
| 0x0E       | 1        | unsigned char                                       | m_bCharacter                  |
+------------+----------+-----------------------------------------------------+-------------------------------+
| 0x0F       | 1        | unsigned char                                       | m_nCharacterHasNotRead        |
+------------+----------+-----------------------------------------------------+-------------------------------+

Asm Definition

::

   CGameJournalEntry        struct
     m_strText              dd ?
     m_nTime                dd ?
     m_Flag                 CGameJournalEntryFlag <>
     m_wType                dw ?
     m_bCharacter           db ?
     m_nCharacterHasNotRead db ?
   CGameJournalEntry        ends


.. _CGameObject:

CGameObject
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 4        | vfptr                                  | vfptr                         |
+------------+----------+----------------------------------------+-------------------------------+
| 0x04       | 1        | unsigned char                          | m_objectType                  |
+------------+----------+----------------------------------------+-------------------------------+
|            | 3        |                                        | ``<padding>``                 |
+------------+----------+----------------------------------------+-------------------------------+
| 0x08       | 8        | :ref:`CPoint<CPoint>`                  | m_pos                         |
+------------+----------+----------------------------------------+-------------------------------+
| 0x10       | 4        | long                                   | m_posZ                        |
+------------+----------+----------------------------------------+-------------------------------+
| 0x14       | 4        | :ref:`CGameArea<CGameArea>`\*          | m_pArea                       |
+------------+----------+----------------------------------------+-------------------------------+
| 0x18       | 4        | __POSITION\*                           | m_posVertList                 |
+------------+----------+----------------------------------------+-------------------------------+
| 0x1C       | 1        | unsigned char                          | m_listType                    |
+------------+----------+----------------------------------------+-------------------------------+
|            | 3        |                                        | ``<padding>``                 |
+------------+----------+----------------------------------------+-------------------------------+
| 0x20       | 20       | :ref:`CAIObjectType<CAIObjectType>`    | m_typeAI                      |
+------------+----------+----------------------------------------+-------------------------------+
| 0x34       | 4        | long                                   | m_id                          |
+------------+----------+----------------------------------------+-------------------------------+
| 0x38       | 2        | short                                  | m_canBeSeen                   |
+------------+----------+----------------------------------------+-------------------------------+
|            | 2        |                                        | ``<padding>``                 |
+------------+----------+----------------------------------------+-------------------------------+
| 0x3C       | 4        | int                                    | m_remotePlayerID              |
+------------+----------+----------------------------------------+-------------------------------+
| 0x40       | 4        | long                                   | m_remoteObjectID              |
+------------+----------+----------------------------------------+-------------------------------+
| 0x44       | 1        | unsigned char                          | m_AISpeed                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x45       | 1        | unsigned char                          | m_bLocalControl               |
+------------+----------+----------------------------------------+-------------------------------+
| 0x46       | 1        | unsigned char                          | m_AIInhibitor                 |
+------------+----------+----------------------------------------+-------------------------------+
|            | 1        |                                        | ``<padding>``                 |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

   CGameObject          struct
     vfptr              dd ?
     m_objectType       db ?
                        db ? ; padding
                        db ? ; padding
                        db ? ; padding
     m_pos              CPoint <>
     m_posZ             dd ?
     m_pArea            dd ? ; CGameArea* 
     m_posVertList      dd ? ; __POSITION* 
     m_listType         db ?
                        db ? ; padding
                        db ? ; padding
                        db ? ; padding
     m_typeAI           CAIObjectType <>
     m_id               dd ?
     m_canBeSeen        dw ?
                        dw ? ; padding
     m_remotePlayerID   dd ?
     m_remoteObjectID   dd ?
     m_AISpeed          db ?
     m_bLocalControl    db ?
     m_AIInhibitor      db ?
                        db ? ; padding
   CGameObject          ends


.. _CGameObjectArray:

CGameObjectArray
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
|            | 1        |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+


.. _CGameObjectArrayEntry:

CGameObjectArrayEntry
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 2        | short                                  | m_objectId                    |
+------------+----------+----------------------------------------+-------------------------------+
|            | 2        |                                        | ``<padding>``                 |
+------------+----------+----------------------------------------+-------------------------------+
| 0x04       | 4        | :ref:`CGameObject<CGameObject>`\*      | m_objectPtr                   |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

   CGameObjectArrayEntry    struct
     m_objectId             dw ?
                            dw ? ; padding
     m_objectPtr            dd ? ; CGameObject*
   CGameObjectArrayEntry    ends


.. _CGameOptions:

CGameOptions
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

      data +0x00 [sizeof=4] unsigned long m_gore
      data +0x04 [sizeof=4] unsigned long m_goreOption
      data +0x08 [sizeof=4] unsigned long m_scrollSpeed
      data +0x0c [sizeof=4] unsigned long m_displayVerbalText
      data +0x10 [sizeof=4] unsigned long m_guiFeedBackLevel
      data +0x14 [sizeof=4] unsigned long m_locatorFeedBackLevel
      data +0x18 [sizeof=4] unsigned long m_soundMusicVolume
      data +0x1c [sizeof=4] unsigned long m_soundFXVolume
      data +0x20 [sizeof=4] unsigned long m_soundDialogVolume
      data +0x24 [sizeof=4] unsigned long m_nVolumeAmbients
      data +0x28 [sizeof=4] unsigned long m_soundMovieVolume
      data +0x2c [sizeof=4] unsigned long m_soundFootStepsOn
      data +0x30 [sizeof=4] unsigned long m_soundVoicesNo
      data +0x34 [sizeof=4] unsigned long m_graphicsBrightness
      data +0x38 [sizeof=4] unsigned long m_graphicsFontZoom
      data +0x3c [sizeof=4] float m_spriteBlurAmount
      data +0x40 [sizeof=4] unsigned long m_graphicsTranslucentShadows
      data +0x44 [sizeof=4] unsigned long m_graphicsForceMirroringOff
      data +0x48 [sizeof=4] unsigned long m_graphicsTranslucentEffects
      data +0x4c [sizeof=4] unsigned long m_toolTips
      data +0x50 [sizeof=4] unsigned long m_nBoredTime
      data +0x54 [sizeof=4] unsigned long m_nCommandSoundsFrequency
      data +0x58 [sizeof=4] unsigned long m_nSelectionSoundsFrequency
      data +0x5c [sizeof=4] unsigned long m_bAlwaysDither
      data +0x60 [sizeof=4] unsigned long m_nKeyBoardScrollAmount
      data +0x64 [sizeof=4] unsigned long m_nEffectTextLevel
      data +0x68 [sizeof=4] unsigned long m_nTutorialState
      data +0x6c [sizeof=4] unsigned long m_nAttackSounds
      data +0x70 [sizeof=4] unsigned long m_nAutoPauseState
      data +0x74 [sizeof=4] unsigned long m_bAutoPauseCenter
      data +0x78 [sizeof=4] long m_nDifficultyMultiplier
      data +0x7c [sizeof=4] long m_nMPDifficultyMultiplier
      data +0x80 [sizeof=4] int m_bNoExtraDamage
      data +0x84 [sizeof=4] int m_bAutoUseMagicAmmo
      data +0x88 [sizeof=4] int m_bNoExtraXP
      data +0x8c [sizeof=4] unsigned long m_bInfravision
      data +0x90 [sizeof=4] unsigned long m_bStupidQuickItemStuff
      data +0x94 [sizeof=4] int m_bWeatherEnabled
      data +0x98 [sizeof=4] int m_bCheatsEnabled
      data +0x9c [sizeof=4] int m_bEnvironmentalAudio
      data +0xa0 [sizeof=4] int m_bRestHealParty
      data +0xa4 [sizeof=4] int m_bTerrainHugging
      data +0xa8 [sizeof=4] int m_bHPOverHead
      data +0xac [sizeof=4] int m_bDebugMode
      data +0xb0 [sizeof=4] int m_bUIEditMode
      data +0xb4 [sizeof=4] int m_bCloudSavesEnabled
      data +0xb8 [sizeof=4] int m_bNeverShowNuisanceSOD
      data +0xbc [sizeof=4] int m_nActiveCampaign
      data +0xc0 [sizeof=4] int m_bDeveloperMode
      data +0xc4 [sizeof=4] int m_bForceDialogPause
      data +0xc8 [sizeof=4] int m_bUse3dAnimations
      data +0xcc [sizeof=4] int m_bCriticalHitScreenShake
      data +0xd0 [sizeof=4] int m_bHotkeysOnToolTips
      data +0xd4 [sizeof=4] int m_bVeryLowPerformance
      data +0xd8 [sizeof=4] int m_bDisplayExtraCombatInfo
      data +0xdc [sizeof=2] unsigned short m_nAreaEffectsDensity
      <padding> (2 bytes)
      data +0xe0 [sizeof=4] int m_bDuplicateFloatingText
      data +0xe4 [sizeof=1] unsigned char m_nTilesPrecachePercent
      <padding> (3 bytes)
      data +0xe8 [sizeof=4] int m_bColorCircles
      data +0xec [sizeof=4] int m_bClassicCircles
      data +0xf0 [sizeof=4] int m_nCombatUI
      data +0xf4 [sizeof=4] int m_bOverConfirmEverything
      data +0xf8 [sizeof=4] int m_bShowLearnableSpells
      data +0xfc [sizeof=4] int m_bShowTriggersOnTab
      data +0x100 [sizeof=4] int m_bShowBlackSpace
      data +0x104 [sizeof=4] int m_bUseNearestNeighbourScaling
      data +0x108 [sizeof=4] int m_showAOE
      data +0x10c [sizeof=4] int m_bDisableCastingGlows
      data +0x110 [sizeof=4] int m_bLowMemSounds1
      data +0x114 [sizeof=4] int m_bLowMemSounds2
      data +0x118 [sizeof=4] int m_bDisableVEFVidCells
      data +0x11c [sizeof=4] int m_bDisableDisplayText
      data +0x120 [sizeof=4] int m_bMidLevelBrighten
      data +0x124 [sizeof=4] int m_bHighLevelBrighten
      data +0x128 [sizeof=2] unsigned short m_nAreaEffectsRefreshProb
      <padding> (2 bytes)
      data +0x12c [sizeof=4] int m_bEnhancedPathSearch
      data +0x130 [sizeof=4] int m_bPausingMap
      data +0x134 [sizeof=4] int m_bExtraFeedback
      data +0x138 [sizeof=4] int m_bFilterGames
      data +0x13c [sizeof=4] int m_bAllLearnSpellInfo
      data +0x140 [sizeof=4] int m_bDisableStaticsDuringCombat
      data +0x144 [sizeof=4] int m_bDisableFootstepsDuringCombat
      data +0x148 [sizeof=4] int m_bDisablePlacedSoundsDuringCombat
      data +0x14c [sizeof=4] long m_nSuperDesperateSpeedAttempt
      data +0x150 [sizeof=4] int m_bAutomatedSpeedAdjusting
      data +0x154 [sizeof=4] int m_bAutomatedGraphicsTranslucentShadows
      data +0x158 [sizeof=4] int m_bAutomatedVeryLowPerformance
      data +0x15c [sizeof=4] int m_bAutomatedLowPerformance
      data +0x160 [sizeof=4] int m_bAutomatedDisableBrightest
      data +0x164 [sizeof=4] int m_bAutomatedLimitTransparency
      data +0x168 [sizeof=4] int m_bAutomatedDisableCastingGlows
      data +0x16c [sizeof=4] int m_bAutomatedDisableVEFVidCells
      data +0x170 [sizeof=4] int m_bAutomatedMidLevelBrighten
      data +0x174 [sizeof=4] int m_bAutomatedHighLevelBrighten
      data +0x178 [sizeof=4] int m_bAutomatedSoundFootStepsOn
      data +0x17c [sizeof=4] int m_bAutomatedAttackSounds
      data +0x180 [sizeof=4] int m_bAutomatedUse3dAnimations
      data +0x184 [sizeof=4] int m_bAutomatedDisableVVCSounds
      data +0x188 [sizeof=4] int m_bAutomatedFasterBlur
      data +0x18c [sizeof=4] long m_nCutAutomatedGraphicsTranslucentShadows
      data +0x190 [sizeof=4] long m_nCutAutomatedVeryLowPerformance
      data +0x194 [sizeof=4] long m_nCutAutomatedLowPerformance
      data +0x198 [sizeof=4] long m_nCutAutomatedDisableBrightest
      data +0x19c [sizeof=4] long m_nCutAutomatedLimitTransparency
      data +0x1a0 [sizeof=4] long m_nCutAutomatedDisableCastingGlows
      data +0x1a4 [sizeof=4] long m_nCutAutomatedDisableVEFVidCells
      data +0x1a8 [sizeof=4] long m_nCutAutomatedMidLevelBrighten
      data +0x1ac [sizeof=4] long m_nCutAutomatedHighLevelBrighten
      data +0x1b0 [sizeof=4] long m_nCutAutomatedSoundFootStepsOn
      data +0x1b4 [sizeof=4] long m_nCutAutomatedAttackSounds
      data +0x1b8 [sizeof=4] long m_nCutAutomatedUse3dAnimations
      data +0x1bc [sizeof=4] long m_nCutAutomatedDisableVVCSounds
      data +0x1c0 [sizeof=4] long m_nCutAutomatedFasterBlur
      data +0x1c4 [sizeof=4] int m_bPCOnlyCombatMode
      data +0x1c8 [sizeof=4] int m_bFullyDisableNonVisibleDuringCombat
      data +0x1cc [sizeof=4] int m_bDisableVVCSounds
      data +0x1d0 [sizeof=4] int m_bFasterBlur
      data +0x1d4 [sizeof=4] long m_nFatFingerRadius
      data +0x1d8 [sizeof=4] int m_bScaleUI
      data +0x1dc [sizeof=4] long m_nRenderActionQueue
      data +0x1e0 [sizeof=4] int m_bConfirmDialog
      data +0x1e4 [sizeof=4] int m_bHardwareMouseCursor
      data +0x1e8 [sizeof=4] int m_bShowHealth
      data +0x1ec [sizeof=4] int m_bMaxHP
      data +0x1f0 [sizeof=4] int m_bStoryMode
      data +0x1f4 [sizeof=4] int m_bNightmareMode
      data +0x1f8 [sizeof=4] int m_bNightmareBonusGold
      data +0x1fc [sizeof=4] int m_bNightmareBonusXP
      data +0x200 [sizeof=4] int m_b3ESneakAttack
      data +0x204 [sizeof=4] int m_bClericRangerFix
      data +0x208 [sizeof=4] int m_bShowPauseDate
      data +0x20c [sizeof=4] int m_bDisableCosmeticAttacks
      data +0x210 [sizeof=4] int m_bJournalPopups
      data +0x214 [sizeof=4] int m_bRenderTravelRegions
      data +0x218 [sizeof=4] int m_bRenderSearchMap
      data +0x21c [sizeof=4] int m_bRenderDynamicSearchMap
      data +0x220 [sizeof=4] int m_bRenderFrameTimes
      data +0x224 [sizeof=4] int m_bZoomLock
      data +0x228 [sizeof=4] int m_bDisableMultiplayerBanters
      data +0x22c [sizeof=4] int m_bRenderPath
      data +0x230 [sizeof=4] int m_bFogEnabled
      data +0x234 [sizeof=4] int m_bUseSpriteShader
      data +0x238 [sizeof=4] int m_bCharacterHighlightsEnabled
      data +0x23c [sizeof=4] int m_bGreyscaleOnPauseEnabled
      data +0x240 [sizeof=4] int m_bShortDescription
      data +0x244 [sizeof=4] long m_nMaxStringEntries
      data +0x248 [sizeof=4] int m_bRenderExploredMap
      data +0x24c [sizeof=4] int m_bEnableDirectX
      data +0x250 [sizeof=4] int m_bEnableMPChatMenu
      data +0x254 [sizeof=4] int m_bExpireTraps
      data +0x258 [sizeof=4] long m_nDifficultyLevel


.. _CGamePermission:

CGamePermission
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 8        | unsigned char                          | m_permission[8]               |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

   CGamePermission  struct
     m_permission   db 8 dup (?)
   CGamePermission  ends


.. _CGameRemoteObjectArray:

CGameRemoteObjectArray
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+-------------------------------------------------------------------------+---------------------------------------+
| **Offset** | **Size** | **Type**                                                                | **Field**                             |
+------------+----------+-------------------------------------------------------------------------+---------------------------------------+
| 0x00       | 4        | :ref:`CGameRemoteObjectListEntry<CGameRemoteObjectListEntry>`\*\*       | m_pArray                              |
+------------+----------+-------------------------------------------------------------------------+---------------------------------------+
| 0x04       | 2        | short                                                                   | m_nArraySize                          |
+------------+----------+-------------------------------------------------------------------------+---------------------------------------+
| 0x06       | 2        | short                                                                   | m_nControlsChanged                    |
+------------+----------+-------------------------------------------------------------------------+---------------------------------------+
| 0x08       | 4        | :ref:`CGameRemoteObjectControlChange<CGameRemoteObjectControlChange>`\* | m_pControlsChanged                    |
+------------+----------+-------------------------------------------------------------------------+---------------------------------------+
| 0x0C       | 4        | :ref:`CGameRemoteObjectControlChange<CGameRemoteObjectControlChange>`\* | m_pControlsChangedTail                |
+------------+----------+-------------------------------------------------------------------------+---------------------------------------+
| 0x10       | 2        | short                                                                   | m_nDeletions                          |
+------------+----------+-------------------------------------------------------------------------+---------------------------------------+
|            | 2        |                                                                         | ``<padding>``                         |
+------------+----------+-------------------------------------------------------------------------+---------------------------------------+
| 0x14       | 4        | :ref:`CGameRemoteObjectDeletion<CGameRemoteObjectDeletion>`\*           | m_pDeletions                          |
+------------+----------+-------------------------------------------------------------------------+---------------------------------------+
| 0x18       | 4        | :ref:`CGameRemoteObjectDeletion<CGameRemoteObjectDeletion>`\*           | m_pDeletionsTail                      |
+------------+----------+-------------------------------------------------------------------------+---------------------------------------+
| 0x1C       | 2        | short                                                                   | m_nControlsAreaChanged                |
+------------+----------+-------------------------------------------------------------------------+---------------------------------------+
| 0x1E       | 48       | :ref:`CResRef<CResRef>`                                                 | m_psControlsAreaChangedName[6]        |
+------------+----------+-------------------------------------------------------------------------+---------------------------------------+
|            | 2        |                                                                         | ``<padding>``                         |
+------------+----------+-------------------------------------------------------------------------+---------------------------------------+
| 0x50       | 24       | unsigned long                                                           | m_pnControlsAreaChangedPlayerNum[6]   |
+------------+----------+-------------------------------------------------------------------------+---------------------------------------+
| 0x68       | 12       | short                                                                   | m_pnControlsAreaChangedFirstObject[6] |
+------------+----------+-------------------------------------------------------------------------+---------------------------------------+

Asm Definition

::

   CGameRemoteObjectArray               struct
     m_pArray                           dd ? ; CGameRemoteObjectListEntry** 
     m_nArraySize                       dw ?
     m_nControlsChanged                 dw ?
     m_pControlsChanged                 dd ? ; CGameRemoteObjectControlChange* 
     m_pControlsChangedTail             dd ? ; CGameRemoteObjectControlChange* 
     m_nDeletions                       dw ?
                                        dw ? ; padding
     m_pDeletions                       dd ? ; CGameRemoteObjectDeletion* 
     m_pDeletionsTail                   dd ? ; CGameRemoteObjectDeletion* 
     m_nControlsAreaChanged             dw ?
     m_psControlsAreaChangedName        CResRef 6 dup ({})
                                        db ? ; padding
                                        db ? ; padding
     m_pnControlsAreaChangedPlayerNum   dd 6 dup (?)
     m_pnControlsAreaChangedFirstObject dw 6 dup (?)
   CGameRemoteObjectArray


.. _CGameRemoteObjectControlChange:

CGameRemoteObjectControlChange
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+-------------------------------------------------------------------------+--------------+
| **Offset** | **Size** | **Type**                                                                | **Field**    |
+------------+----------+-------------------------------------------------------------------------+--------------+
| 0x00       | 4        | int                                                                     | oldPlayerID  |
+------------+----------+-------------------------------------------------------------------------+--------------+
| 0x04       | 4        | long                                                                    | oldObjectID  |
+------------+----------+-------------------------------------------------------------------------+--------------+
| 0x08       | 4        | int                                                                     | newPlayerID  |
+------------+----------+-------------------------------------------------------------------------+--------------+
| 0x0C       | 4        | long                                                                    | newObjectID  |
+------------+----------+-------------------------------------------------------------------------+--------------+
| 0x10       | 4        | :ref:`CGameRemoteObjectControlChange<CGameRemoteObjectControlChange>`\* | pNext        |
+------------+----------+-------------------------------------------------------------------------+--------------+
| 0x14       | 1        | unsigned char                                                           | localControl |
+------------+----------+-------------------------------------------------------------------------+--------------+
|            | 3        |                                                                         | ``<padding>``|
+------------+----------+-------------------------------------------------------------------------+--------------+

Asm Definition

::

   CGameRemoteObjectControlChange   struct
     oldPlayerID                    dd ?
     oldObjectID                    dd ?
     newPlayerID                    dd ?
     newObjectID                    dd ?
     pNext                          dd ? ; CGameRemoteObjectControlChange* 
     localControl                   db ?
                                    db ? ; padding
                                    db ? ; padding
                                    db ? ; padding
   CGameRemoteObjectControlChange   ends


.. _CGameRemoteObjectDeletion:

CGameRemoteObjectDeletion
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+---------------------------------------------------------------+-----------------+
| **Offset** | **Size** | **Type**                                                      | **Field**       |
+------------+----------+---------------------------------------------------------------+-----------------+
| 0x00       | 4        | int                                                           | deletedPlayerID |
+------------+----------+---------------------------------------------------------------+-----------------+
| 0x04       | 4        | long                                                          | deletedObjectID |
+------------+----------+---------------------------------------------------------------+-----------------+
| 0x08       | 4        | :ref:`CGameRemoteObjectDeletion<CGameRemoteObjectDeletion>`\* | pNext           |
+------------+----------+---------------------------------------------------------------+-----------------+

Asm Definition

::

   CGameRemoteObjectDeletion    struct
     deletedPlayerID            dd ?
     deletedObjectID            dd ?
     pNext                      dd ? ; CGameRemoteObjectDeletion* 
   CGameRemoteObjectDeletion    ends


.. _CGameRemoteObjectListEntry:

CGameRemoteObjectListEntry
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+-----------------------------------------------------------------+----------------+
| **Offset** | **Size** | **Type**                                                        | **Field**      |
+------------+----------+-----------------------------------------------------------------+----------------+
| 0x00       | 4        | int                                                             | remotePlayerID |
+------------+----------+-----------------------------------------------------------------+----------------+
| 0x04       | 4        | long                                                            | remoteObjectID |
+------------+----------+-----------------------------------------------------------------+----------------+
| 0x08       | 4        | long                                                            | localObjectID  |
+------------+----------+-----------------------------------------------------------------+----------------+
| 0x0C       | 4        | :ref:`CGameRemoteObjectListEntry<CGameRemoteObjectListEntry>`\* | pNext          |
+------------+----------+-----------------------------------------------------------------+----------------+

Asm Definition

::

   CGameRemoteObjectListEntry   struct
     remotePlayerID             dd ?
     remoteObjectID             dd ?
     localObjectID              dd ?
     pNext                      dd ? ; CGameRemoteObjectListEntry* 
   CGameRemoteObjectListEntry   ends


.. _CGameRemoveMapNote:

CGameRemoveMapNote
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 324      | :ref:`CGameEffect<CGameEffect>`        | m_cGameEffect                 |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

   CGameRemoveMapNote   struct
     m_cGameEffect      CGameEffect <>
   CGameRemoveMapNote   ends


.. _CGameSave:

CGameSave
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 4        | unsigned long                          | m_inputMode                   |
+------------+----------+----------------------------------------+-------------------------------+
| 0x04       | 8        | :ref:`CResRef<CResRef>`                | m_cResCurrentWorldArea        |
+------------+----------+----------------------------------------+-------------------------------+
| 0x0C       | 4        | unsigned long                          | m_nCurrentWorldLink           |
+------------+----------+----------------------------------------+-------------------------------+
| 0x10       | 4        | unsigned long                          | m_nPartyGold                  |
+------------+----------+----------------------------------------+-------------------------------+
| 0x14       | 2        | short                                  | m_curFormation                |
+------------+----------+----------------------------------------+-------------------------------+
| 0x16       | 10       | short                                  | m_quickFormations[5]          |
+------------+----------+----------------------------------------+-------------------------------+
| 0x20       | 400      | :ref:`CItem<CItem>`\*                  | m_groupInventory[100]         |
+------------+----------+----------------------------------------+-------------------------------+
| 0x1B0      | 4        | int                                    | m_bArenaMode                  |
+------------+----------+----------------------------------------+-------------------------------+
| 0x1B4      | 2        | short                                  | m_groupInventoryNumber        |
+------------+----------+----------------------------------------+-------------------------------+
|            | 2        |                                        | ``<padding>``                 |
+------------+----------+----------------------------------------+-------------------------------+
| 0x1B8      | 4        | unsigned long                          | m_mode                        |
+------------+----------+----------------------------------------+-------------------------------+
| 0x1BC      | 4        | int                                    | m_cutScene                    |
+------------+----------+----------------------------------------+-------------------------------+
| 0x1C0      | 4        | long                                   | m_nCutSceneStatusOverride     |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

   CGameSave                    struct
     m_inputMode                dd ?
     m_cResCurrentWorldArea     CResRef <>
     m_nCurrentWorldLink        dd ?
     m_nPartyGold               dd ?
     m_curFormation             dw ?
     m_quickFormations          dw 5 dup (?)
     m_groupInventory           dd 100 dup (?) ; CItem* 
     m_bArenaMode               dd ?
     m_groupInventoryNumber     dw ?
                                dw ? ; padding
     m_mode                     dd ?
     m_cutScene                 dd ?
     m_nCutSceneStatusOverride  dd ?
   CGameSave                    ends


.. _CGameSaveCharacter:

CGameSaveCharacter
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 4        | unsigned long                          | m_actionMode                  |
+------------+----------+----------------------------------------+-------------------------------+
| 0x04       | 208      | :ref:`CButtonData<CButtonData>`        | m_quickWeapons[4]             |
+------------+----------+----------------------------------------+-------------------------------+
| 0xD4       | 156      | :ref:`CButtonData<CButtonData>`        | m_quickSpells[3]              |
+------------+----------+----------------------------------------+-------------------------------+
| 0x170      | 156      | :ref:`CButtonData<CButtonData>`        | m_quickItems[3]               |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

   CGameSaveCharacter   struct
     m_actionMode       dd ?
     m_quickWeapons     CButtonData 4 dup ({})
     m_quickSpells      CButtonData 3 dup ({})
     m_quickItems       CButtonData 3 dup ({})
   CGameSaveCharacter   ends


.. _CGameSound:

CGameSound
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+---------------------------------------------------+-------------------+
| **Offset** | **Size** | **Type**                                          | **Field**         |
+------------+----------+---------------------------------------------------+-------------------+
| 0x00       | 71       | :ref:`CGameObject<CGameObject>`                   | m_cGameObject     |
+------------+----------+---------------------------------------------------+-------------------+
|            | 1        |                                                   | ``<padding>``     |
+------------+----------+---------------------------------------------------+-------------------+
| 0x48       | 212      | :ref:`CAreaFileSoundObject<CAreaFileSoundObject>` | m_soundObject     |
+------------+----------+---------------------------------------------------+-------------------+
| 0x11c      | 20       | :ref:`CSound<CSound>`                             | m_looping         |
+------------+----------+---------------------------------------------------+-------------------+
| 0x130      | 4        | int                                               | m_bLoopPlaying    |
+------------+----------+---------------------------------------------------+-------------------+
| 0x134      | 4        | long                                              | m_period          |
+------------+----------+---------------------------------------------------+-------------------+
| 0x138      | 4        | long                                              | m_periodCount     |
+------------+----------+---------------------------------------------------+-------------------+
| 0x13c      | 1        | unsigned char                                     | m_currentSound    |
+------------+----------+---------------------------------------------------+-------------------+
|            | 3        |                                                   | ``<padding>``     |
+------------+----------+---------------------------------------------------+-------------------+
| 0x140      | 4        | unsigned long                                     | m_timeOfDayActive |
+------------+----------+---------------------------------------------------+-------------------+

Asm Definition

::

   CGameSound           struct
     m_cGameObject      CGameObject <>
                        db ? ; padding
     m_soundObject      CAreaFileSoundObject <>
     m_looping          CSound <>
     m_bLoopPlaying     dd ?
     m_period           dd ?
     m_periodCount      dd ?
     m_currentSound     db ?
                        db ? ; padding
                        db ? ; padding
                        db ? ; padding
     m_timeOfDayActive  dd ?
   CGameSound           ends


.. _CGameSpawning:

CGameSpawning
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+---------------------------------------------------------------------------------+---------------------------+
| **Offset** | **Size** | **Type**                                                                        | **Field**                 |
+------------+----------+---------------------------------------------------------------------------------+---------------------------+
| 0x00       | 71       | :ref:`CGameObject<CGameObject>`                                                 | m_cGameObject             |
+------------+----------+---------------------------------------------------------------------------------+---------------------------+
|            | 1        |                                                                                 | ``<padding>``             |
+------------+----------+---------------------------------------------------------------------------------+---------------------------+
| 0x48       | 200      | :ref:`CAreaFileRandomMonsterSpawningPoint<CAreaFileRandomMonsterSpawningPoint>` | m_spawningObject          |
+------------+----------+---------------------------------------------------------------------------------+---------------------------+
| 0x110      | 16       | unsigned char                                                                   | m_terrainTable[16]        |
+------------+----------+---------------------------------------------------------------------------------+---------------------------+
| 0x120      | 16       | unsigned char                                                                   | m_visibleTerrainTable[16] |
+------------+----------+---------------------------------------------------------------------------------+---------------------------+
| 0x130      | 4        | long                                                                            | m_nTrackingCounter        |
+------------+----------+---------------------------------------------------------------------------------+---------------------------+
| 0x134      | 4        | unsigned long                                                                   | m_weightSum               |
+------------+----------+---------------------------------------------------------------------------------+---------------------------+

Asm Definition

::

   CGameSpawning            struct
     m_cGameObject          CGameObject <>
                            db ? ; padding
     m_spawningObject       CAreaFileRandomMonsterSpawningPoint <>
     m_terrainTable         db 16 dup (?)
     m_visibleTerrainTable  db 16 dup (?)
     m_nTrackingCounter     dd ?
     m_weightSum            dd ?
   CGameSpawning            ends


.. _CGameSprite:

CGameSprite
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

      base +0x00 [sizeof=1020] CGameAIBase
      data +0x3fc [sizeof=8] CResRef m_resref
      data +0x404 [sizeof=2] unsigned short m_type
      <padding> (2 bytes)
      data +0x408 [sizeof=4] unsigned long m_expirationTime
      data +0x40c [sizeof=2] unsigned short m_huntingRange
      data +0x40e [sizeof=2] unsigned short m_followRange
      data +0x410 [sizeof=8] CPoint m_posStart
      data +0x418 [sizeof=4] unsigned long m_timeOfDayVisible
      data +0x41c [sizeof=616] CCreatureFileHeader m_baseStats
      data +0x684 [sizeof=196] CTypedPtrList<CPtrList,CCreatureFileKnownSpell *> m_knownSpellsPriest[7]
      data +0x748 [sizeof=252] CTypedPtrList<CPtrList,CCreatureFileKnownSpell *> m_knownSpellsMage[9]
      data +0x844 [sizeof=28] CTypedPtrList<CPtrList,CCreatureFileKnownSpell *> m_knownSpellsInnate[1]
      data +0x860 [sizeof=28] CCreatureFileMemorizedSpellLevel* m_memorizedSpellsLevelPriest[7]
      data +0x87c [sizeof=36] CCreatureFileMemorizedSpellLevel* m_memorizedSpellsLevelMage[9]
      data +0x8a0 [sizeof=4] CCreatureFileMemorizedSpellLevel* m_memorizedSpellsLevelInnate[1]
      data +0x8a4 [sizeof=196] CTypedPtrList<CPtrList,CCreatureFileMemorizedSpell *> m_memorizedSpellsPriest[7]
      data +0x968 [sizeof=252] CTypedPtrList<CPtrList,CCreatureFileMemorizedSpell *> m_memorizedSpellsMage[9]
      data +0xa64 [sizeof=28] CTypedPtrList<CPtrList,CCreatureFileMemorizedSpell *> m_memorizedSpellsInnate[1]
      data +0xa80 [sizeof=168] CGameSpriteEquipment m_equipment
      data +0xb28 [sizeof=4] unsigned char* m_pDialogData
      data +0xb2c [sizeof=4] unsigned long m_nDialogData
      data +0xb30 [sizeof=2340] CDerivedStats m_derivedStats
      data +0x1454 [sizeof=2340] CDerivedStats m_tempStats
      data +0x1d78 [sizeof=2340] CDerivedStats m_bonusStats
      data +0x269c [sizeof=524] CGameSaveCharacter m_gameSaveData
      data +0x28a8 [sizeof=4] CString m_sName
      data +0x28ac [sizeof=1] unsigned char m_lastCharacterCount
      <padding> (3 bytes)
      data +0x28b0 [sizeof=164] CGameStatsSprite m_cGameStats
      data +0x2954 [sizeof=8] CResRef m_currentArea
      data +0x295c [sizeof=1] unsigned char m_bGlobal
      data +0x295d [sizeof=1] unsigned char m_nModalState
      <padding> (2 bytes)
      data +0x2960 [sizeof=40] CSound m_sndWalk[2]
      data +0x2988 [sizeof=4] unsigned long m_nSndWalk
      data +0x298c [sizeof=40] CSound m_sndArmor[2]
      data +0x29b4 [sizeof=1] unsigned char m_currSndWalk
      data +0x29b5 [sizeof=1] unsigned char m_currSndArmor
      <padding> (2 bytes)
      data +0x29b8 [sizeof=20] CSound m_sndReady
      data +0x29cc [sizeof=20] CSound m_sndDeath
      data +0x29e0 [sizeof=20] CSound m_sndMagic
      data +0x29f4 [sizeof=20] CSound m_sndVoice
      data +0x2a08 [sizeof=20] CSound m_sndSpriteEffect
      data +0x2a1c [sizeof=4] long m_nNumberOfTimesTalkedTo
      data +0x2a20 [sizeof=4] int m_bSeenPartyBefore
      data +0x2a24 [sizeof=8] CResRef m_specificScriptName
      data +0x2a2c [sizeof=96] long m_nNumberOfTimesInteractedWith[24]
      data +0x2a8c [sizeof=2] short m_nHappiness
      data +0x2a8e [sizeof=2] short m_nOldHappiness
      data +0x2a90 [sizeof=20] CAIObjectType m_interactingWith
      data +0x2aa4 [sizeof=4] long m_triggerId
      data +0x2aa8 [sizeof=4] int m_active
      data +0x2aac [sizeof=4] int m_activeAI
      data +0x2ab0 [sizeof=4] int m_activeImprisonment
      data +0x2ab4 [sizeof=4] int m_bSelected
      data +0x2ab8 [sizeof=4] int m_bPortraitUpdate
      data +0x2abc [sizeof=1] unsigned char m_bInfravisionOn
      data +0x2abd [sizeof=16] unsigned char m_terrainTable[16]
      data +0x2acd [sizeof=16] unsigned char m_visibleTerrainTable[16]
      data +0x2add [sizeof=16] unsigned char m_flightTerrainTable[16]
      <padding> (3 bytes)
      data +0x2af0 [sizeof=16] CGameAnimation m_animation
      data +0x2b00 [sizeof=4] unsigned short* m_pSpriteEffectArray
      data +0x2b04 [sizeof=4] tagPOINT* m_pSpriteEffectArrayPosition
      data +0x2b08 [sizeof=1] unsigned char m_nTwitches
      data +0x2b09 [sizeof=1] unsigned char m_spriteEffectSequenceNumber
      data +0x2b0a [sizeof=1] unsigned char m_spriteEffectDuration
      data +0x2b0b [sizeof=1] unsigned char m_spriteEffectSequenceLength
      data +0x2b0c [sizeof=1] char m_spriteEffectBaseIntensity
      data +0x2b0d [sizeof=1] unsigned char m_spriteEffectRandomIntensity
      <padding> (2 bytes)
      data +0x2b10 [sizeof=192] CVidCell m_spriteEffectVidCell
      data +0x2bd0 [sizeof=36] CVidPalette m_spriteEffectPalette
      data +0x2bf4 [sizeof=4] unsigned long m_spriteEffectFlags
      data +0x2bf8 [sizeof=192] CVidCell m_spriteSplashVidCell
      data +0x2cb8 [sizeof=36] CVidPalette m_spriteSplashPalette
      data +0x2cdc [sizeof=4] unsigned long m_spriteSplashFlags
      data +0x2ce0 [sizeof=16] CRect m_rSpriteEffectFX
      data +0x2cf0 [sizeof=8] CPoint m_ptSpriteEffectReference
      data +0x2cf8 [sizeof=1] unsigned char m_effectExtendDirection
      data +0x2cf9 [sizeof=1] unsigned char m_bEscapingArea
      <padding> (2 bytes)
      data +0x2cfc [sizeof=4] int m_animationRunning
      data +0x2d00 [sizeof=4] long m_posZDelta
      data +0x2d04 [sizeof=1] unsigned char m_doBounce
      data +0x2d05 [sizeof=1] unsigned char m_nMirrorImages
      data +0x2d06 [sizeof=1] unsigned char m_bBlur
      data +0x2d07 [sizeof=1] unsigned char m_bInvisible
      data +0x2d08 [sizeof=1] unsigned char m_bSanctuary
      <padding> (3 bytes)
      data +0x2d0c [sizeof=192] CVidCell m_sanctuaryVidCell
      data +0x2dcc [sizeof=1] unsigned char m_bEntangle
      <padding> (3 bytes)
      data +0x2dd0 [sizeof=192] CVidCell m_entangleVidCell
      data +0x2e90 [sizeof=1] unsigned char m_bMinorGlobe
      <padding> (3 bytes)
      data +0x2e94 [sizeof=192] CVidCell m_minorGlobeVidCell
      data +0x2f54 [sizeof=1] unsigned char m_bShieldGlobe
      <padding> (3 bytes)
      data +0x2f58 [sizeof=192] CVidCell m_shieldGlobeVidCell
      data +0x3018 [sizeof=1] unsigned char m_bGreasePool
      <padding> (3 bytes)
      data +0x301c [sizeof=192] CVidCell m_greasePoolVidCell
      data +0x30dc [sizeof=1] unsigned char m_bWebHold
      <padding> (3 bytes)
      data +0x30e0 [sizeof=192] CVidCell m_webHoldVidCell
      data +0x31a0 [sizeof=8] double m_fCircleChange
      data +0x31a8 [sizeof=8] double m_fCurrCircleChange
      data +0x31b0 [sizeof=2] short m_radius
      data +0x31b2 [sizeof=1] char m_circleFacing
      data +0x31b3 [sizeof=1] unsigned char m_bVisibilityUpdated
      <padding> (4 bytes)
      data +0x31b8 [sizeof=8] double m_fDirectionOffset
      data +0x31c0 [sizeof=2] short m_nSequence
      <padding> (2 bytes)
      data +0x31c4 [sizeof=8] CPoint m_posExact
      data +0x31cc [sizeof=8] CPoint m_posDelta
      data +0x31d4 [sizeof=8] CPoint m_posDest
      data +0x31dc [sizeof=8] CPoint m_posOld
      data +0x31e4 [sizeof=8] CPoint m_posOldWalk
      data +0x31ec [sizeof=8] CPoint m_posLastVisMapEntry
      data +0x31f4 [sizeof=4] long* m_pVisMapExploredArea
      data +0x31f8 [sizeof=2] short m_skipDeltaDirection
      data +0x31fa [sizeof=2] short m_deltaDirection
      data +0x31fc [sizeof=2] short m_nNewDirection
      data +0x31fe [sizeof=2] short m_nDirection
      data +0x3200 [sizeof=4] long* m_pPath
      data +0x3204 [sizeof=2] short m_nPath
      data +0x3206 [sizeof=1] unsigned char m_bCheckMove
      <padding> (1 bytes)
      data +0x3208 [sizeof=28] CTypedPtrList<CPtrList,long *> m_pPathTemp
      data +0x3224 [sizeof=28] CTypedPtrList<CPtrList,long *> m_nPathTemp
      data +0x3240 [sizeof=2] short m_currPath
      <padding> (2 bytes)
      data +0x3244 [sizeof=4] int m_walkBackwards
      data +0x3248 [sizeof=4] int m_turningAbout
      data +0x324c [sizeof=4] unsigned long m_lastRGBColor
      data +0x3250 [sizeof=4] int m_pathSearchInvalidDest
      data +0x3254 [sizeof=4] int m_pathCollision
      data +0x3258 [sizeof=4] CSearchRequest* m_currentSearchRequest
      data +0x325c [sizeof=2] short m_nBloodFlashAmount
      data +0x325e [sizeof=2] short m_nDamageLocatorTime
      data +0x3260 [sizeof=4] unsigned long m_nDamageLocatorColor
      data +0x3264 [sizeof=4] int m_bBloodFlashOn
      data +0x3268 [sizeof=176] CVidBitmap m_vbPortraitSmall
      data +0x3318 [sizeof=4] int m_bVisibleMonster
      data +0x331c [sizeof=4] int m_bBumpable
      data +0x3320 [sizeof=1] unsigned char m_bBumped
      <padding> (3 bytes)
      data +0x3324 [sizeof=8] CPoint m_ptBumpedFrom
      data +0x332c [sizeof=4] int m_bInClearBumpPath
      data +0x3330 [sizeof=4] unsigned long m_nBlockedTick
      data +0x3334 [sizeof=4] int m_followLeader
      data +0x3338 [sizeof=4] int m_followLeaderAdditive
      data +0x333c [sizeof=4] long m_followLeaderNext
      data +0x3340 [sizeof=4] int m_followStart
      data +0x3344 [sizeof=28] CTypedPtrList<CPtrList,CBlood *> m_lstBlood
      data +0x3360 [sizeof=2] short m_castCounter
      <padding> (2 bytes)
      data +0x3364 [sizeof=4] int m_bStartedCasting
      data +0x3368 [sizeof=4] int m_bInCasting
      data +0x336c [sizeof=2] short m_selectedSound
      data +0x336e [sizeof=2] short m_moveCount
      data +0x3370 [sizeof=2] short m_moveToFrontQueue
      data +0x3372 [sizeof=2] short m_moveToBackQueue
      data +0x3374 [sizeof=4] int m_moveToBack
      data +0x3378 [sizeof=4] int m_moveToFront
      data +0x337c [sizeof=44] CGameEffectList m_equipedEffectList
      data +0x33a8 [sizeof=44] CGameEffectList m_timedEffectList
      data +0x33d4 [sizeof=28] CPersistantEffectList m_persistantEffects
      data +0x33f0 [sizeof=20] CGameAbilityList m_lstSelectedLevelUpAbilities
      data +0x3404 [sizeof=8] CPoint m_curDest
      data +0x340c [sizeof=4] long m_nGregsRetryCounter
      data +0x3410 [sizeof=4] int m_bWaitingForAreaLoadInLeaveAreaLUA
      data +0x3414 [sizeof=2] short m_userCommandPause
      data +0x3416 [sizeof=2] short m_nCommandPause
      data +0x3418 [sizeof=8] CPoint m_curPosition
      data +0x3420 [sizeof=4] int m_tookDamage
      data +0x3424 [sizeof=4] __POSITION* m_groupPosition
      data +0x3428 [sizeof=4] int m_groupMove
      data +0x342c [sizeof=4] int m_firstDeadAI
      data +0x3430 [sizeof=4] CProjectile* m_curProjectile
      data +0x3434 [sizeof=4] CSpell* m_curSpell
      data +0x3438 [sizeof=4] CItem* m_curItem
      data +0x343c [sizeof=2] short m_curItemSlotNum
      data +0x343e [sizeof=2] short m_curItemAbilityNum
      data +0x3440 [sizeof=80] short m_weaponProficiencyList[40]
      data +0x3490 [sizeof=8] unsigned char m_generalWeaponList[8]
      data +0x3498 [sizeof=2] short m_speedFactor
      data +0x349a [sizeof=2] short m_lastActionID
      data +0x349c [sizeof=20] CAIObjectType m_liveTypeAI
      data +0x34b0 [sizeof=20] CAIObjectType m_startTypeAI
      data +0x34c4 [sizeof=4] int m_endOfDamageSeq
      data +0x34c8 [sizeof=2] short m_playDeadCounter
      data +0x34ca [sizeof=2] short m_turnToStoneCounter
      data +0x34cc [sizeof=2] short m_lightningReactCounter
      data +0x34ce [sizeof=2] short m_sleepCounter
      data +0x34d0 [sizeof=2] short m_runCounter
      data +0x34d2 [sizeof=2] short m_searchPauseCount
      data +0x34d4 [sizeof=4] int m_doneSearch
      data +0x34d8 [sizeof=2] short m_dieCount
      data +0x34da [sizeof=2] short m_pauseCount
      data +0x34dc [sizeof=2] short m_recoilFrame
      data +0x34de [sizeof=2] short m_attackFrame
      data +0x34e0 [sizeof=4] long m_noActionCount
      data +0x34e4 [sizeof=4] int m_inFormation
      data +0x34e8 [sizeof=4] int m_newEffect
      data +0x34ec [sizeof=1] unsigned char m_canDamage
      <padding> (3 bytes)
      data +0x34f0 [sizeof=4] int m_leftAttack
      data +0x34f4 [sizeof=1] unsigned char m_halfAttack
      <padding> (3 bytes)
      data +0x34f8 [sizeof=4] int m_hasColorEffects
      data +0x34fc [sizeof=4] int m_hasColorRangeEffects
      data +0x3500 [sizeof=4] int m_hasAnimationEffects
      data +0x3504 [sizeof=4] int m_removeFromArea
      data +0x3508 [sizeof=4] int m_forceAnimationReset
      data +0x350c [sizeof=44] CMarker m_marker
      data +0x3538 [sizeof=44] CMarker m_destMarker
      data +0x3564 [sizeof=4] long m_targetId
      data +0x3568 [sizeof=8] CPoint m_targetPoint
      data +0x3570 [sizeof=2] short m_targetAreaSize
      data +0x3572 [sizeof=1] unsigned char m_nTempSelectedWeapon
      data +0x3573 [sizeof=1] unsigned char m_nTempSelectedWeaponAbility
      data +0x3574 [sizeof=52] CButtonData m_currentUseButton
      data +0x35a8 [sizeof=8] CResRef m_dialog
      data +0x35b0 [sizeof=8] CResRef m_dialogInteraction
      data +0x35b8 [sizeof=1] unsigned char m_sequenceTest
      <padding> (3 bytes)
      data +0x35bc [sizeof=4] STR_RES* m_speech
      data +0x35c0 [sizeof=1] unsigned char m_saveVSDeathRoll
      data +0x35c1 [sizeof=1] unsigned char m_saveVSWandsRoll
      data +0x35c2 [sizeof=1] unsigned char m_saveVSPolyRoll
      data +0x35c3 [sizeof=1] unsigned char m_saveVSBreathRoll
      data +0x35c4 [sizeof=1] unsigned char m_saveVSSpellRoll
      data +0x35c5 [sizeof=1] unsigned char m_magicResistRoll
      data +0x35c6 [sizeof=1] unsigned char m_probabilityRoll
      data +0x35c7 [sizeof=1] unsigned char m_wildMageLevelModRoll
      data +0x35c8 [sizeof=1] unsigned char m_wildMageSurgeRoll
      <padding> (1 bytes)
      data +0x35ca [sizeof=2] short m_wildSurgeLevel
      data +0x35cc [sizeof=2] short m_nSelectionCountCommon
      data +0x35ce [sizeof=2] short m_nSelectionCountCommonRareCounter
      data +0x35d0 [sizeof=2] short m_nSelectionCountRare
      data +0x35d2 [sizeof=2] short m_nSelectionCountAction
      data +0x35d4 [sizeof=4] long m_lastCheckedHitPoints
      data +0x35d8 [sizeof=4] int m_moraleFailure
      data +0x35dc [sizeof=4] int m_startedSwing
      data +0x35e0 [sizeof=2] short m_followCount
      <padding> (2 bytes)
      data +0x35e4 [sizeof=4] int m_clearAIOnRemoveFromArea
      data +0x35e8 [sizeof=4] long m_dialogWait
      data +0x35ec [sizeof=4] long m_dialogWaitTarget
      data +0x35f0 [sizeof=4] long m_talkingCounter
      data +0x35f4 [sizeof=1] unsigned char m_talkingRenderCount
      data +0x35f5 [sizeof=1] unsigned char m_inControlLastTime
      data +0x35f6 [sizeof=1] unsigned char m_bSecondPass
      <padding> (1 bytes)
      data +0x35f8 [sizeof=28] CTypedPtrList<CPtrList,CPortraitIcon *> m_portraitIcons
      data +0x3614 [sizeof=192] CVidCell m_portraitIconVidCell
      data +0x36d4 [sizeof=4] int m_firstActionSound
      data +0x36d8 [sizeof=4] long m_lastRested
      data +0x36dc [sizeof=4] int m_berserkActive
      data +0x36e0 [sizeof=2] short m_attackSoundDeadzone
      <padding> (2 bytes)
      data +0x36e4 [sizeof=4] long m_nHPCONBonusTotalOld
      data +0x36e8 [sizeof=4] int m_bHPCONBonusTotalUpdate
      data +0x36ec [sizeof=4] long m_nLastWeightCheck
      data +0x36f0 [sizeof=4] unsigned long m_modalCounter
      data +0x36f4 [sizeof=4] int m_bHiding
      data +0x36f8 [sizeof=4] unsigned long m_lastRegenerationTime
      data +0x36fc [sizeof=4] int m_bLevelUp
      data +0x3700 [sizeof=1] unsigned char m_bAllowDialogInterrupt
      data +0x3701 [sizeof=1] unsigned char m_bHappinessChanged
      <padding> (2 bytes)
      data +0x3704 [sizeof=4] long m_nUnselectableCounter
      data +0x3708 [sizeof=4] unsigned long m_nUnselectableType
      data +0x370c [sizeof=8] CResRef m_secondarySounds
      data +0x3714 [sizeof=4] long m_nStealthGreyOut
      data +0x3718 [sizeof=4] int m_bMentalStateActing
      data +0x371c [sizeof=12] int m_nLastLevelUpLevel[3]
      data +0x3728 [sizeof=4] int m_nLastLevelUpHPRoll
      data +0x372c [sizeof=4] int m_bForceVisualEffects
      data +0x3730 [sizeof=2] short m_currentActionId
      <padding> (2 bytes)
      data +0x3734 [sizeof=4] int m_bPlayedEncumberedStopped
      data +0x3738 [sizeof=4] int m_bPlayedEncumberedSlowed
      data +0x373c [sizeof=4] long m_nPlayedEncumberedStopped
      data +0x3740 [sizeof=4] long m_nPlayedEncumberedSlowed
      data +0x3744 [sizeof=2] short m_nPlayedPoisonedDamage
      data +0x3746 [sizeof=2] short m_nEffectListCalls
      data +0x3748 [sizeof=4] int m_bAllowEffectListCall
      data +0x374c [sizeof=1] unsigned char m_nPreCutSceneMoveScale
      <padding> (3 bytes)
      data +0x3750 [sizeof=4] int m_bUsingCutSceneMovement
      data +0x3754 [sizeof=4] int m_bDeleteOnRemove
      data +0x3758 [sizeof=4] CVariableHash* m_pLocalVariables
      data +0x375c [sizeof=4] int m_bInUnmarshal
      data +0x3760 [sizeof=28] CBounceList m_lBounceList
      data +0x377c [sizeof=4] long m_nTransitionPointIndex
      data +0x3780 [sizeof=4] long m_nBounceCounter
      data +0x3784 [sizeof=4] long m_nMoraleAI
      data +0x3788 [sizeof=4] long m_nGeneratedVEFIndex
      data +0x378c [sizeof=4] long m_nTrackingCounter
      data +0x3790 [sizeof=4] CGameButtonList* m_interalButtonList
      data +0x3794 [sizeof=4] CAIScript* m_dreamScript
      data +0x3798 [sizeof=104] CGameDialogSprite m_cDialog
      data +0x3800 [sizeof=104] CGameDialogSprite m_cBanter
      data +0x3868 [sizeof=1] unsigned char m_bForceVisRangeRedraw
      <padding> (3 bytes)
      data +0x386c [sizeof=4] long m_nLastExpiryCheck
      data +0x3870 [sizeof=4] long m_nLastContingencyCheck
      data +0x3874 [sizeof=4] CString m_hitBonusesLeft
      data +0x3878 [sizeof=4] CString m_hitBonusesRight
      data +0x387c [sizeof=4] CString m_damageBonusesLeft
      data +0x3880 [sizeof=4] CString m_damageBonusesRight
      data +0x3884 [sizeof=2] short m_effectMovementRate
      <padding> (2 bytes)
      data +0x3888 [sizeof=4] unsigned long m_effectStateFlags
      data +0x388c [sizeof=144] CCreatureFileMemorizedSpellLevel m_effectMemorizedSpellsLevelMage[9]
      data +0x391c [sizeof=112] CCreatureFileMemorizedSpellLevel m_effectMemorizedSpellsLevelPriest[7]
      data +0x398c [sizeof=4] int m_effectStoreInitialized
      data +0x3990 [sizeof=1] unsigned char m_nLevellingUp
      <padding> (3 bytes)
      data +0x3994 [sizeof=4] int m_bHasDeathSequence
      data +0x3998 [sizeof=28] CTypedPtrList<CPtrList,long *> m_lstTargetIds
      data +0x39b4 [sizeof=28] CTypedPtrList<CPtrList,CPoint *> m_lstTargetPts
      data +0x39d0 [sizeof=4] int m_bInStoreState
      data +0x39d4 [sizeof=4] int m_bInDialogState
      data +0x39d8 [sizeof=4] long m_nDialogState
      data +0x39dc [sizeof=4] long m_nWaitingOnDialog
      data +0x39e0 [sizeof=1] bool m_bHighlightPortrait
      <padding> (3 bytes)
      data +0x39e4 [sizeof=4] unsigned long m_nHighlightColor
      data +0x39e8 [sizeof=4] int m_bCutSceneOverrideOfState
      data +0x39ec [sizeof=4] int m_bForceEffectProcessFromTimeStop
      data +0x39f0 [sizeof=4] int m_bCopyForAdd
      data +0x39f4 [sizeof=4] long m_nCopyParent
      data +0x39f8 [sizeof=28] CTypedPtrList<CPtrList,CFeedbackEntry *> m_feedbackQueue
      data +0x3a14 [sizeof=4] int m_bOnSearchMap
      data +0x3a18 [sizeof=4] int m_bRemovedFromMap
      data +0x3a1c [sizeof=120] CGameSpriteLastUpdate m_cLastSpriteUpdate
      data +0x3a94 [sizeof=4] int m_bSendSpriteUpdate
      data +0x3a98 [sizeof=4] long m_nLastDamageTaken
      data +0x3a9c [sizeof=4] long m_nDeadVisualEffectCountDown
      data +0x3aa0 [sizeof=4] int m_bForceVisibilityCheck
      data +0x3aa4 [sizeof=1] unsigned char m_nVisualRange
      <padding> (3 bytes)
      data +0x3aa8 [sizeof=4] int m_bPlayAnimationBattleCry
      data +0x3aac [sizeof=4] int m_bPlayAnimationSelectionSound
      data +0x3ab0 [sizeof=10] unsigned char m_aLevellupSpellsToPick[10]
      <padding> (2 bytes)
      data +0x3abc [sizeof=4] long m_nCrossAreaChaseCounter
      data +0x3ac0 [sizeof=4] int m_bDidAReequipAll
      data +0x3ac4 [sizeof=4] int m_bInEquip
      data +0x3ac8 [sizeof=1] char m_cFirstResSlot
      <padding> (3 bytes)
      data +0x3acc [sizeof=4] long m_nNumColorRanges
      data +0x3ad0 [sizeof=4] long m_nNumColorEffects
      data +0x3ad4 [sizeof=4] long m_nNumWeaponImmunities
      data +0x3ad8 [sizeof=4] int m_bCheckedIfVisiblePause
      data +0x3adc [sizeof=4] int m_bCheckedSpecialAbilities
      data +0x3ae0 [sizeof=4] int m_bDroppedTempItem
      data +0x3ae4 [sizeof=4] long m_nSkippedUpdates
      data +0x3ae8 [sizeof=4] int m_bDelayUpdate
      data +0x3aec [sizeof=4] long m_nHalfSwingCounter
      data +0x3af0 [sizeof=1] bool m_bInCopy
      <padding> (3 bytes)
      data +0x3af4 [sizeof=28] CTypedPtrList<CPtrList,CGameSprite::GroundItem *> m_lstVisibleGroundItems
      data +0x3b10 [sizeof=4] int m_nGroundItemPage
      data +0x3b14 [sizeof=4] float m_avgProcessAITime

























.. _CGameSpriteGroundItem:

CGameSprite\:\:GroundItem
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 4        | long                                   | containerID                   |
+------------+----------+----------------------------------------+-------------------------------+
| 0x04       | 4        | long                                   | itemSlot                      |
+------------+----------+----------------------------------------+-------------------------------+
| 0x08       | 8        | :ref:`CResRef<CResRef>`                | item                          |
+------------+----------+----------------------------------------+-------------------------------+
| 0x10       | 8        | :ref:`CResRef<CResRef>`                | itemIcon                      |
+------------+----------+----------------------------------------+-------------------------------+
| 0x18       | 2        | unsigned short                         | count                         |
+------------+----------+----------------------------------------+-------------------------------+
|            | 2        |                                        | ``<padding>``                 |
+------------+----------+----------------------------------------+-------------------------------+
| 0x1C       | 4        | unsigned long                          | itemFlags                     |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

   CGameSpriteGroundItem    struct
     containerID            dd ?
     itemSlot               dd ?
     item                   CResRef <>
     itemIcon               CResRef <>
     count                  dw ?
                            dw ? ; padding
     itemFlags              dd ?
   CGameSpriteGroundItem    ends


.. _CGameSpriteRenderHealthBar:

CGameSprite\:\:RenderHealthBar
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 8        | :ref:`SDL_Point<SDL_Point>`            | pt                            |
+------------+----------+----------------------------------------+-------------------------------+
| 0x08       | 4        | unsigned long                          | c                             |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

   CGameSpriteRenderHealthBar   struct
     pt                         SDL_Point <>
     c                          dd ?
   CGameSpriteRenderHealthBar   ends


.. _CGameSpriteEquipment:

CGameSpriteEquipment
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 156      | :ref:`CItem<CItem>`\*                  | m_items[39]                   |
+------------+----------+----------------------------------------+-------------------------------+
| 0x9C       | 1        | unsigned char                          | m_selectedWeapon              |
+------------+----------+----------------------------------------+-------------------------------+
|            | 1        |                                        | ``<padding>``                 |
+------------+----------+----------------------------------------+-------------------------------+
| 0x9E       | 2        | unsigned short                         | m_selectedWeaponAbility       |
+------------+----------+----------------------------------------+-------------------------------+
| 0xA0       | 4        | :ref:`CItem<CItem>`\*                  | m_pTempItem                   |
+------------+----------+----------------------------------------+-------------------------------+
| 0xA4       | 4        | :ref:`CGameSprite<CGameSprite>`\*      | m_pSprite                     |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

   CGameSpriteEquipment         struct
     m_items                    dd 39 dup (?) ; CItem* 
     m_selectedWeapon           db ?
                                db ? ; padding
     m_selectedWeaponAbility    dw ?
     m_pTempItem                dd ? ; CItem* 
     m_pSprite                  dd ? ; CGameSprite* 
   CGameSpriteEquipment         ends


.. _CGameSpriteLastUpdate:

CGameSpriteLastUpdate
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
|            |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

      data +0x00 [sizeof=4] long* m_pPath
      data +0x04 [sizeof=2] short m_nPath
      data +0x06 [sizeof=2] short m_currPath
      data +0x08 [sizeof=8] CPoint m_ptDest
      data +0x10 [sizeof=1] unsigned char m_nMoveScale
      <padding> (1 bytes)
      data +0x12 [sizeof=2] short m_nSequence
      data +0x14 [sizeof=8] CPoint m_ptPosition
      data +0x1c [sizeof=2] short m_nFacing
      <padding> (2 bytes)
      data +0x20 [sizeof=4] unsigned long m_dwState
      data +0x24 [sizeof=2] short m_nHitPoints
      data +0x26 [sizeof=2] short m_nMaxHitPoints
      data +0x28 [sizeof=2] short m_nArmorClass
      data +0x2a [sizeof=2] short m_nACCrushingMod
      data +0x2c [sizeof=2] short m_nACMissileMod
      data +0x2e [sizeof=2] short m_nACPiercingMod
      data +0x30 [sizeof=2] short m_nACSlashingMod
      data +0x32 [sizeof=2] short m_nPortraitIcons
      data +0x34 [sizeof=4] long* m_pPortraitIcons
      data +0x38 [sizeof=1] unsigned char m_nEnemyAlly
      data +0x39 [sizeof=1] unsigned char m_nEnemyAllyLive
      data +0x3a [sizeof=1] unsigned char m_bMoraleFailure
      data +0x3b [sizeof=1] unsigned char m_nGeneral
      data +0x3c [sizeof=1] unsigned char m_nGeneralLive
      <padding> (3 bytes)
      data +0x40 [sizeof=4] CString m_sAreaString
      data +0x44 [sizeof=1] unsigned char m_bLevelUp
      <padding> (3 bytes)
      data +0x48 [sizeof=4] long m_nHPCONBonusTotalOld
      data +0x4c [sizeof=1] unsigned char m_bSummonDisable
      data +0x4d [sizeof=1] unsigned char m_bDoNotJump
      data +0x4e [sizeof=1] unsigned char m_bSanctuary
      data +0x4f [sizeof=1] unsigned char m_bDisableCircle
      data +0x50 [sizeof=1] unsigned char m_bHeld
      data +0x51 [sizeof=1] unsigned char m_bActiveImprisonment
      <padding> (2 bytes)
      data +0x54 [sizeof=32] unsigned long m_spellState[8]
      data +0x74 [sizeof=4] int m_bFullUpdateRequired



.. _CGameStatic:

CGameStatic
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+-----------------------------------------------------+------------------------+
| **Offset** | **Size** | **Type**                                            | **Field**              |
+------------+----------+-----------------------------------------------------+------------------------+
| 0x00       | 71       | :ref:`CGameObject<CGameObject>`                     | m_cGameObject          |
+------------+----------+-----------------------------------------------------+------------------------+
|            | 1        |                                                     | ``<padding>``          |
+------------+----------+-----------------------------------------------------+------------------------+
| 0x48       | 76       | :ref:`CAreaFileStaticObject<CAreaFileStaticObject>` | m_header               |
