.. _CG Structures:

==========================
CG Structures
==========================

.. toctree::
   :maxdepth: 2
   :hidden:
   
   CGameEffect/index


* :ref:`CGameAIArea<CGameAIArea>`
* :ref:`CGameAIBase<CGameAIBase>`
* :ref:`CGameAIGame<CGameAIGame>`
* :ref:`CGameAbilityList<CGameAbilityList>`
* :ref:`CGameAddMapNote<CGameAddMapNote>`
* :ref:`CGameAnimation<CGameAnimation>`
* :ref:`CGameAnimationType<CGameAnimationType>`
* :ref:`CGameAnimationTypeAmbient<CGameAnimationTypeAmbient>`
* :ref:`CGameAnimationTypeAmbientStatic<CGameAnimationTypeAmbientStatic>`
* :ref:`CGameAnimationTypeCharacter<CGameAnimationTypeCharacter>`
* :ref:`CGameAnimationTypeCharacterOld<CGameAnimationTypeCharacterOld>`
* :ref:`CGameAnimationTypeEffect<CGameAnimationTypeEffect>`
* :ref:`CGameAnimationTypeFlying<CGameAnimationTypeFlying>`
* :ref:`CGameAnimationTypeMonster<CGameAnimationTypeMonster>`
* :ref:`CGameAnimationTypeMonsterAnkheg<CGameAnimationTypeMonsterAnkheg>`
* :ref:`CGameAnimationTypeMonsterIcewind<CGameAnimationTypeMonsterIcewind>`
* :ref:`CGameAnimationTypeMonsterLarge<CGameAnimationTypeMonsterLarge>`
* :ref:`CGameAnimationTypeMonsterLarge16<CGameAnimationTypeMonsterLarge16>`
* :ref:`CGameAnimationTypeMonsterLayered<CGameAnimationTypeMonsterLayered>`
* :ref:`CGameAnimationTypeMonsterLayeredSpell<CGameAnimationTypeMonsterLayeredSpell>`
* :ref:`CGameAnimationTypeMonsterMulti<CGameAnimationTypeMonsterMulti>`
* :ref:`CGameAnimationTypeMonsterMultiNew<CGameAnimationTypeMonsterMultiNew>`

| 0x220      |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
| 0x224      |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
| 0x228      |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
| 0x22C      |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
| 0x230      |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
| 0x234      |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
| 0x238      |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
| 0x23C      |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
| 0x240      |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
| 0x244      |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
| 0x248      |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
| 0x24C      |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
| 0x250      |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
| 0x254      |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+
| 0x258      |          |                                        |                               |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

      data +0x00 [sizeof=4] unsigned long m_gore
      data +0x04 [sizeof=4] unsigned long m_goreOption
      data +0x08 [sizeof=4] unsigned long m_scrollSpeed
      data +0x0c [sizeof=4] unsigned long m_displayVerbalText
      data +0x10 [sizeof=4] unsigned long m_guiFeedBackLevel
      data +0x14 [sizeof=4] unsigned long m_locatorFeedBackLevel
      data +0x18 [sizeof=4] unsigned long m_soundMusicVolume
      data +0x1c [sizeof=4] unsigned long m_soundFXVolume
      data +0x20 [sizeof=4] unsigned long m_soundDialogVolume
      data +0x24 [sizeof=4] unsigned long m_nVolumeAmbients
      data +0x28 [sizeof=4] unsigned long m_soundMovieVolume
      data +0x2c [sizeof=4] unsigned long m_soundFootStepsOn
      data +0x30 [sizeof=4] unsigned long m_soundVoicesNo
      data +0x34 [sizeof=4] unsigned long m_graphicsBrightness
      data +0x38 [sizeof=4] unsigned long m_graphicsFontZoom
      data +0x3c [sizeof=4] float m_spriteBlurAmount
      data +0x40 [sizeof=4] unsigned long m_graphicsTranslucentShadows
      data +0x44 [sizeof=4] unsigned long m_graphicsForceMirroringOff
      data +0x48 [sizeof=4] unsigned long m_graphicsTranslucentEffects
      data +0x4c [sizeof=4] unsigned long m_toolTips
      data +0x50 [sizeof=4] unsigned long m_nBoredTime
      data +0x54 [sizeof=4] unsigned long m_nCommandSoundsFrequency
      data +0x58 [sizeof=4] unsigned long m_nSelectionSoundsFrequency
      data +0x5c [sizeof=4] unsigned long m_bAlwaysDither
      data +0x60 [sizeof=4] unsigned long m_nKeyBoardScrollAmount
      data +0x64 [sizeof=4] unsigned long m_nEffectTextLevel
      data +0x68 [sizeof=4] unsigned long m_nTutorialState
      data +0x6c [sizeof=4] unsigned long m_nAttackSounds
      data +0x70 [sizeof=4] unsigned long m_nAutoPauseState
      data +0x74 [sizeof=4] unsigned long m_bAutoPauseCenter
      data +0x78 [sizeof=4] long m_nDifficultyMultiplier
      data +0x7c [sizeof=4] long m_nMPDifficultyMultiplier
      data +0x80 [sizeof=4] int m_bNoExtraDamage
      data +0x84 [sizeof=4] int m_bAutoUseMagicAmmo
      data +0x88 [sizeof=4] int m_bNoExtraXP
      data +0x8c [sizeof=4] unsigned long m_bInfravision
      data +0x90 [sizeof=4] unsigned long m_bStupidQuickItemStuff
      data +0x94 [sizeof=4] int m_bWeatherEnabled
      data +0x98 [sizeof=4] int m_bCheatsEnabled
      data +0x9c [sizeof=4] int m_bEnvironmentalAudio
      data +0xa0 [sizeof=4] int m_bRestHealParty
      data +0xa4 [sizeof=4] int m_bTerrainHugging
      data +0xa8 [sizeof=4] int m_bHPOverHead
      data +0xac [sizeof=4] int m_bDebugMode
      data +0xb0 [sizeof=4] int m_bUIEditMode
      data +0xb4 [sizeof=4] int m_bCloudSavesEnabled
      data +0xb8 [sizeof=4] int m_bNeverShowNuisanceSOD
      data +0xbc [sizeof=4] int m_nActiveCampaign
      data +0xc0 [sizeof=4] int m_bDeveloperMode
      data +0xc4 [sizeof=4] int m_bForceDialogPause
      data +0xc8 [sizeof=4] int m_bUse3dAnimations
      data +0xcc [sizeof=4] int m_bCriticalHitScreenShake
      data +0xd0 [sizeof=4] int m_bHotkeysOnToolTips
      data +0xd4 [sizeof=4] int m_bVeryLowPerformance
      data +0xd8 [sizeof=4] int m_bDisplayExtraCombatInfo
      data +0xdc [sizeof=2] unsigned short m_nAreaEffectsDensity
      <padding> (2 bytes)
      data +0xe0 [sizeof=4] int m_bDuplicateFloatingText
      data +0xe4 [sizeof=1] unsigned char m_nTilesPrecachePercent
      <padding> (3 bytes)
      data +0xe8 [sizeof=4] int m_bColorCircles
      data +0xec [sizeof=4] int m_bClassicCircles
      data +0xf0 [sizeof=4] int m_nCombatUI
      data +0xf4 [sizeof=4] int m_bOverConfirmEverything
      data +0xf8 [sizeof=4] int m_bShowLearnableSpells
      data +0xfc [sizeof=4] int m_bShowTriggersOnTab
      data +0x100 [sizeof=4] int m_bShowBlackSpace
      data +0x104 [sizeof=4] int m_bUseNearestNeighbourScaling
      data +0x108 [sizeof=4] int m_showAOE
      data +0x10c [sizeof=4] int m_bDisableCastingGlows
      data +0x110 [sizeof=4] int m_bLowMemSounds1
      data +0x114 [sizeof=4] int m_bLowMemSounds2
      data +0x118 [sizeof=4] int m_bDisableVEFVidCells
      data +0x11c [sizeof=4] int m_bDisableDisplayText
      data +0x120 [sizeof=4] int m_bMidLevelBrighten
      data +0x124 [sizeof=4] int m_bHighLevelBrighten
      data +0x128 [sizeof=2] unsigned short m_nAreaEffectsRefreshProb
      <padding> (2 bytes)
      data +0x12c [sizeof=4] int m_bEnhancedPathSearch
      data +0x130 [sizeof=4] int m_bPausingMap
      data +0x134 [sizeof=4] int m_bExtraFeedback
      data +0x138 [sizeof=4] int m_bFilterGames
      data +0x13c [sizeof=4] int m_bAllLearnSpellInfo
      data +0x140 [sizeof=4] int m_bDisableStaticsDuringCombat
      data +0x144 [sizeof=4] int m_bDisableFootstepsDuringCombat
      data +0x148 [sizeof=4] int m_bDisablePlacedSoundsDuringCombat
      data +0x14c [sizeof=4] long m_nSuperDesperateSpeedAttempt
      data +0x150 [sizeof=4] int m_bAutomatedSpeedAdjusting
      data +0x154 [sizeof=4] int m_bAutomatedGraphicsTranslucentShadows
      data +0x158 [sizeof=4] int m_bAutomatedVeryLowPerformance
      data +0x15c [sizeof=4] int m_bAutomatedLowPerformance
      data +0x160 [sizeof=4] int m_bAutomatedDisableBrightest
      data +0x164 [sizeof=4] int m_bAutomatedLimitTransparency
      data +0x168 [sizeof=4] int m_bAutomatedDisableCastingGlows
      data +0x16c [sizeof=4] int m_bAutomatedDisableVEFVidCells
      data +0x170 [sizeof=4] int m_bAutomatedMidLevelBrighten
      data +0x174 [sizeof=4] int m_bAutomatedHighLevelBrighten
      data +0x178 [sizeof=4] int m_bAutomatedSoundFootStepsOn
      data +0x17c [sizeof=4] int m_bAutomatedAttackSounds
      data +0x180 [sizeof=4] int m_bAutomatedUse3dAnimations
      data +0x184 [sizeof=4] int m_bAutomatedDisableVVCSounds
      data +0x188 [sizeof=4] int m_bAutomatedFasterBlur
      data +0x18c [sizeof=4] long m_nCutAutomatedGraphicsTranslucentShadows
      data +0x190 [sizeof=4] long m_nCutAutomatedVeryLowPerformance
      data +0x194 [sizeof=4] long m_nCutAutomatedLowPerformance
      data +0x198 [sizeof=4] long m_nCutAutomatedDisableBrightest
      data +0x19c [sizeof=4] long m_nCutAutomatedLimitTransparency
      data +0x1a0 [sizeof=4] long m_nCutAutomatedDisableCastingGlows
      data +0x1a4 [sizeof=4] long m_nCutAutomatedDisableVEFVidCells
      data +0x1a8 [sizeof=4] long m_nCutAutomatedMidLevelBrighten
      data +0x1ac [sizeof=4] long m_nCutAutomatedHighLevelBrighten
      data +0x1b0 [sizeof=4] long m_nCutAutomatedSoundFootStepsOn
      data +0x1b4 [sizeof=4] long m_nCutAutomatedAttackSounds
      data +0x1b8 [sizeof=4] long m_nCutAutomatedUse3dAnimations
      data +0x1bc [sizeof=4] long m_nCutAutomatedDisableVVCSounds
      data +0x1c0 [sizeof=4] long m_nCutAutomatedFasterBlur
      data +0x1c4 [sizeof=4] int m_bPCOnlyCombatMode
      data +0x1c8 [sizeof=4] int m_bFullyDisableNonVisibleDuringCombat
      data +0x1cc [sizeof=4] int m_bDisableVVCSounds
      data +0x1d0 [sizeof=4] int m_bFasterBlur
      data +0x1d4 [sizeof=4] long m_nFatFingerRadius
      data +0x1d8 [sizeof=4] int m_bScaleUI
      data +0x1dc [sizeof=4] long m_nRenderActionQueue
      data +0x1e0 [sizeof=4] int m_bConfirmDialog
      data +0x1e4 [sizeof=4] int m_bHardwareMouseCursor
      data +0x1e8 [sizeof=4] int m_bShowHealth
      data +0x1ec [sizeof=4] int m_bMaxHP
      data +0x1f0 [sizeof=4] int m_bStoryMode
      data +0x1f4 [sizeof=4] int m_bNightmareMode
      data +0x1f8 [sizeof=4] int m_bNightmareBonusGold
      data +0x1fc [sizeof=4] int m_bNightmareBonusXP
      data +0x200 [sizeof=4] int m_b3ESneakAttack
      data +0x204 [sizeof=4] int m_bClericRangerFix
      data +0x208 [sizeof=4] int m_bShowPauseDate
      data +0x20c [sizeof=4] int m_bDisableCosmeticAttacks
      data +0x210 [sizeof=4] int m_bJournalPopups
      data +0x214 [sizeof=4] int m_bRenderTravelRegions
      data +0x218 [sizeof=4] int m_bRenderSearchMap
      data +0x21c [sizeof=4] int m_bRenderDynamicSearchMap
      data +0x220 [sizeof=4] int m_bRenderFrameTimes
      data +0x224 [sizeof=4] int m_bZoomLock
      data +0x228 [sizeof=4] int m_bDisableMultiplayerBanters
      data +0x22c [sizeof=4] int m_bRenderPath
      data +0x230 [sizeof=4] int m_bFogEnabled
      data +0x234 [sizeof=4] int m_bUseSpriteShader
      data +0x238 [sizeof=4] int m_bCharacterHighlightsEnabled
      data +0x23c [sizeof=4] int m_bGreyscaleOnPauseEnabled
      data +0x240 [sizeof=4] int m_bShortDescription
      data +0x244 [sizeof=4] long m_nMaxStringEntries
      data +0x248 [sizeof=4] int m_bRenderExploredMap
      data +0x24c [sizeof=4] int m_bEnableDirectX
      data +0x250 [sizeof=4] int m_bEnableMPChatMenu
      data +0x254 [sizeof=4] int m_bExpireTraps
      data +0x258 [sizeof=4] long m_nDifficultyLevel


.. _CGamePermission:

CGamePermission
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+----------------------------------------+-------------------------------+
| **Offset** | **Size** | **Type**                               | **Field**                     |
+------------+----------+----------------------------------------+-------------------------------+
| 0x00       | 8        | unsigned char                          | m_permission[8]               |
+------------+----------+----------------------------------------+-------------------------------+

Asm Definition

::

   CGamePermission  struct
     m_permission   db 8 dup (?)
   CGamePermission  ends


.. _CGameRemoteObjectArray:

CGameRemoteObjectArray
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

+------------+----------+-------------------------------------------------------------------------+---------------------------------------+
